Перем КонтекстЯдра;
Перем Ожидаем;
Перем СравнениеТаблиц;

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра 		= КонтекстЯдраПараметр;
	Ожидаем 			= КонтекстЯдра.Плагин("УтвержденияBDD");
	СравнениеТаблиц 	= КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц"); 
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	НаборТестов.Добавить("Могу_Провести_ПодключениеУслуги_Базовый");
	НаборТестов.Добавить("Могу_Провести_ОтключениеУслуги_Базовый");
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Процедура ИнициализацияИнтерактивная() 
	
	Если ПустаяСтрока(КаталогПлагинов) Тогда
		КаталогПлагинов 	= "C:\Program Files (x86)\OneScript\lib\add\plugins";
	КонецЕсли;
	
	Если Ожидаем = Неопределено Тогда
		Ожидаем 			= ВнешниеОбработки.Создать(КаталогПлагинов + "\УтвержденияBDD.epf");
	КонецЕсли;

	Если СравнениеТаблиц = Неопределено Тогда
		СравнениеТаблиц 	= ВнешниеОбработки.Создать(КаталогПлагинов + "\УтвержденияПроверкаТаблиц.epf");
	КонецЕсли;
	
КонецПроцедуры

#Область Тесты

Процедура Могу_Провести_ПодключениеУслуги_Базовый() Экспорт
	ИнициализацияИнтерактивная();
		
	ОбъектыВПамяти 			= Новый Массив;
	ОбъектыВПамяти.Добавить(СоздатьОбъектВПамяти_ПодключениеУслуги_Базовый());
	
	ДополнительныеСвойства 	= Новый Структура;
	ТаблицыПодмены 			= Новый Соответствие;
	ТаблицыПодмены.Вставить("Документ.энргОперацияСУслугами", ОбъектыВПамяти);
	ДополнительныеСвойства.Вставить("ТаблицыПодмены", ТаблицыПодмены);
	Документы.энргОперацияСУслугами.ИнициализироватьДанныеДокумента(ОбъектыВПамяти[0].Ссылка,ДополнительныеСвойства);
	ПроверитьРезультаты_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ДополнительныеСвойства.КлючиТаблицДвижений, ДополнительныеСвойства.ТаблицыДвижений);	
КонецПроцедуры

Процедура Могу_Провести_ОтключениеУслуги_Базовый() Экспорт
	ИнициализацияИнтерактивная();
		
	ОбъектыВПамяти 			= Новый Массив;
	ОбъектыВПамяти.Добавить(СоздатьОбъектВПамяти_ОтключениеУслуги_Базовый());
	
	ДополнительныеСвойства 	= Новый Структура;
	ТаблицыПодмены 			= Новый Соответствие;
	ТаблицыПодмены.Вставить("Документ.энргОперацияСУслугами", ОбъектыВПамяти);
	ДополнительныеСвойства.Вставить("ТаблицыПодмены", ТаблицыПодмены);
	Документы.энргОперацияСУслугами.ИнициализироватьДанныеДокумента(ОбъектыВПамяти[0].Ссылка,ДополнительныеСвойства);
	ПроверитьРезультаты_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ДополнительныеСвойства.КлючиТаблицДвижений, ДополнительныеСвойства.ТаблицыДвижений);	
КонецПроцедуры

#КонецОбласти

#Область Могу_Провести_ПодключениеУслуги_Базовый

Функция СоздатьОбъектВПамяти_ПодключениеУслуги_Базовый()	
	
	#Область ВидыБлагоустройстваТарифныеКатегории
	мВидыБлагоустройстваТарифныеКатегории = Новый Массив;
	я_строка_ВидыБлагоустройстваТарифныеКатегории = Новый Структура;
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("НомерСтроки",1);
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("8d3582b0-c894-11e9-b7f6-005056bc3fc8")));
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("ВидБлагоустройстваИндивидуальный",Справочники.энргВидыБлагоустройств.ПолучитьСсылку(Новый УникальныйИдентификатор("5300e765-d072-11e9-b7f6-005056bc3fc8")));
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("ТарифнаяКатегория",Справочники.энргГруппыПотребителей.ПолучитьСсылку(Новый УникальныйИдентификатор("25c9416f-d2d0-11e9-b7f6-005056bc3fc8")));
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("Ссылка",Документы.энргОперацияСУслугами.ПолучитьСсылку(Новый УникальныйИдентификатор("d32c14e3-1727-11ea-b517-005056bc3fc8")));
	мВидыБлагоустройстваТарифныеКатегории.Добавить(я_строка_ВидыБлагоустройстваТарифныеКатегории);
	#КонецОбласти
	#Область ЗначенияИзмерителей
	мЗначенияИзмерителей = Новый Массив;
	#КонецОбласти
	#Область ПоказанияПриборовУчета
	мПоказанияПриборовУчета = Новый Массив;
	я_строка_ПоказанияПриборовУчета = Новый Структура;
	я_строка_ПоказанияПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ПоказанияПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("5c2ac26e-dc98-4157-8510-4d7f2487f7d6"));
	я_строка_ПоказанияПриборовУчета.Вставить("ТарифнаяЗона",Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор("96878b7a-82b3-11e9-9919-005056bc3fc8")));
	я_строка_ПоказанияПриборовУчета.Вставить("ТекущиеПоказания",1);
	я_строка_ПоказанияПриборовУчета.Вставить("Переворот",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ДатаПоследнихПоказаний",'0001-01-01 00:00:00');
	я_строка_ПоказанияПриборовУчета.Вставить("СреднийОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Разница",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ПереворотИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("СтатусИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныйОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ЗначениеТарифа",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Сумма",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СостояниеПоказаний",Перечисления.энргСостояниеПоказаний.ПустаяСсылка());
	я_строка_ПоказанияПриборовУчета.Вставить("КоэффициентПУ",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредыдущиеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредставлениеЗначениеТарифа","");
	я_строка_ПоказанияПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСУслугами.ПолучитьСсылку(Новый УникальныйИдентификатор("d32c14e3-1727-11ea-b517-005056bc3fc8")));
	мПоказанияПриборовУчета.Добавить(я_строка_ПоказанияПриборовУчета);
	я_строка_ПоказанияПриборовУчета = Новый Структура;
	я_строка_ПоказанияПриборовУчета.Вставить("НомерСтроки",2);
	я_строка_ПоказанияПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("bed80006-7860-4643-8fce-aa5de83d0156"));
	я_строка_ПоказанияПриборовУчета.Вставить("ТарифнаяЗона",Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор("96878b7a-82b3-11e9-9919-005056bc3fc8")));
	я_строка_ПоказанияПриборовУчета.Вставить("ТекущиеПоказания",1);
	я_строка_ПоказанияПриборовУчета.Вставить("Переворот",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ДатаПоследнихПоказаний",'0001-01-01 00:00:00');
	я_строка_ПоказанияПриборовУчета.Вставить("СреднийОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Разница",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ПереворотИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("СтатусИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныйОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ЗначениеТарифа",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Сумма",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СостояниеПоказаний",Перечисления.энргСостояниеПоказаний.ПустаяСсылка());
	я_строка_ПоказанияПриборовУчета.Вставить("КоэффициентПУ",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредыдущиеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредставлениеЗначениеТарифа","");
	я_строка_ПоказанияПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСУслугами.ПолучитьСсылку(Новый УникальныйИдентификатор("d32c14e3-1727-11ea-b517-005056bc3fc8")));
	мПоказанияПриборовУчета.Добавить(я_строка_ПоказанияПриборовУчета);
	#КонецОбласти
	#Область ПоставщикиСоставныхУслуг
	мПоставщикиСоставныхУслуг = Новый Массив;
	#КонецОбласти
	#Область ПрочиеУслуги
	мПрочиеУслуги = Новый Массив;
	#КонецОбласти
	#Область ТочкиУчета
	мТочкиУчета = Новый Массив;
	я_строка_ТочкиУчета = Новый Структура;
	я_строка_ТочкиУчета.Вставить("НомерСтроки",1);
	я_строка_ТочкиУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("49ae7fe0-5314-49aa-bf7d-ea4459114bc0"));
	я_строка_ТочкиУчета.Вставить("IDСтрокиРодитель",Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	я_строка_ТочкиУчета.Вставить("ДатаВыпуска",'2019-12-01 12:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаПоверкиСчетчика",'2020-12-05 12:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиПломбы",'2019-12-25 12:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДиаметрСечения",0);
	я_строка_ТочкиУчета.Вставить("КоэффициентПУ",1);
	я_строка_ТочкиУчета.Вставить("НаправлениеИспользованияТУ",Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("ab0bd74c-c894-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("НетВозможностьУстановкиПУ",Ложь);
	я_строка_ТочкиУчета.Вставить("НомерПломбы","1123456");
	я_строка_ТочкиУчета.Вставить("ОписаниеПрибора","{
	|""ЗаводскойНомер"": ""123456"",
	|""РегистрируетОбъем"": ""Нет"",
	|""ТипПрибораУчета"": ""8bf9183f-be35-11e9-b7f6-005056bc3fc8"",
	|""ВидКанальности"": ""6c919768-988b-11e9-b7f6-005056bc3fc8""
	|}");
	я_строка_ТочкиУчета.Вставить("ОписаниеТочки","{
	|""НаименованиеТочки"": ""полив_Холодное водоснабжение"",
	|""Расположение"": ""0caf2747-c4c0-11e9-b7f6-005056bc3fc8"",
	|""Головная"": false
	|}");
	я_строка_ТочкиУчета.Вставить("Поставщик",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("be6da574-9bb4-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("ПриборУчета",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("9389fdc1-0102-46f2-8074-9c41644d4cc3")));
	я_строка_ТочкиУчета.Вставить("РассчитыватьПоДиаметруСечения",Ложь);
	я_строка_ТочкиУчета.Вставить("Техническая",Ложь);
	я_строка_ТочкиУчета.Вставить("ТочкаУчета",Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("c5a6d252-8243-4f1c-b146-5e9eec6fbc20")));
	я_строка_ТочкиУчета.Вставить("УдалитьВидКанальности",Справочники.энргВидыКанальности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("8d3582b0-c894-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("ЭтоСоставнаяУслуга",Ложь);
	я_строка_ТочкиУчета.Вставить("Ссылка",Документы.энргОперацияСУслугами.ПолучитьСсылку(Новый УникальныйИдентификатор("d32c14e3-1727-11ea-b517-005056bc3fc8")));
	мТочкиУчета.Добавить(я_строка_ТочкиУчета);
	#КонецОбласти
	#Область ШкалыПриборовУчета
	мШкалыПриборовУчета = Новый Массив;
	я_строка_ШкалыПриборовУчета = Новый Структура;
	я_строка_ШкалыПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ШкалыПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("5c2ac26e-dc98-4157-8510-4d7f2487f7d6"));
	я_строка_ШкалыПриборовУчета.Вставить("IDСтрокиТочкиУчета",Новый УникальныйИдентификатор("c0a91c84-cff8-4945-9400-d466a2824f5e"));
	я_строка_ШкалыПриборовУчета.Вставить("ВидДифференцированности",Справочники.энргВидыДифференцированности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ШкалыПриборовУчета.Вставить("Шкала",Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("6c919786-988b-11e9-b7f6-005056bc3fc8")));
	я_строка_ШкалыПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСУслугами.ПолучитьСсылку(Новый УникальныйИдентификатор("d32c14e3-1727-11ea-b517-005056bc3fc8")));
	мШкалыПриборовУчета.Добавить(я_строка_ШкалыПриборовУчета);
	я_строка_ШкалыПриборовУчета = Новый Структура;
	я_строка_ШкалыПриборовУчета.Вставить("НомерСтроки",2);
	я_строка_ШкалыПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("bed80006-7860-4643-8fce-aa5de83d0156"));
	я_строка_ШкалыПриборовУчета.Вставить("IDСтрокиТочкиУчета",Новый УникальныйИдентификатор("49ae7fe0-5314-49aa-bf7d-ea4459114bc0"));
	я_строка_ШкалыПриборовУчета.Вставить("ВидДифференцированности",Справочники.энргВидыДифференцированности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ШкалыПриборовУчета.Вставить("Шкала",Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("6c919786-988b-11e9-b7f6-005056bc3fc8")));
	я_строка_ШкалыПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСУслугами.ПолучитьСсылку(Новый УникальныйИдентификатор("d32c14e3-1727-11ea-b517-005056bc3fc8")));
	мШкалыПриборовУчета.Добавить(я_строка_ШкалыПриборовУчета);
	#КонецОбласти
	#Область ЗаполнениеОбъекта
	ОбъектСтруктура  = Новый Структура;
	ОбъектСтруктура.Вставить("Проведен",Истина);
	ОбъектСтруктура.Вставить("Ссылка",Документы.энргОперацияСУслугами.ПолучитьСсылку(Новый УникальныйИдентификатор("d32c14e3-1727-11ea-b517-005056bc3fc8")));
	ОбъектСтруктура.Вставить("ПометкаУдаления",Ложь);
	ОбъектСтруктура.Вставить("Дата",'2019-12-25 01:24:01');
	ОбъектСтруктура.Вставить("Номер","00000000027");
	ОбъектСтруктура.Вставить("Абонент",Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор("08b143a7-2444-41e3-90ae-9658d76e9875")));
	ОбъектСтруктура.Вставить("ВидОперации",Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги);
	ОбъектСтруктура.Вставить("ДатаФактическогоСобытия",'0001-01-01 00:00:00');
	ОбъектСтруктура.Вставить("КлючПомещения",Справочники.энргКлючиПомещений.ПолучитьСсылку(Новый УникальныйИдентификатор("59938c8a-45f5-4a56-b7a5-c7fe2bf430ff")));
	ОбъектСтруктура.Вставить("Контроллер",Справочники.энргСотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("Организация",Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("5528dddc-9887-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("Ответственный",Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("efe8e81a-836a-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("ПериодНачисления",'2019-12-01 12:00:00');
	ОбъектСтруктура.Вставить("Примечание","");
	ОбъектСтруктура.Вставить("Район",Справочники.энргЗоныОтвественности.ПолучитьСсылку(Новый УникальныйИдентификатор("cd4b5bca-c87d-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("УдалитьАдресОбъекта","");
	ОбъектСтруктура.Вставить("УдалитьЛицевойСчет","");
	ОбъектСтруктура.Вставить("УдалитьМКД",Справочники.энргСтроения.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("ВидыБлагоустройстваТарифныеКатегории",мВидыБлагоустройстваТарифныеКатегории);
	ОбъектСтруктура.Вставить("ЗначенияИзмерителей",мЗначенияИзмерителей);
	ОбъектСтруктура.Вставить("ПоказанияПриборовУчета",мПоказанияПриборовУчета);
	ОбъектСтруктура.Вставить("ПоставщикиСоставныхУслуг",мПоставщикиСоставныхУслуг);
	ОбъектСтруктура.Вставить("ПрочиеУслуги",мПрочиеУслуги);
	ОбъектСтруктура.Вставить("ТочкиУчета",мТочкиУчета);
	ОбъектСтруктура.Вставить("ШкалыПриборовУчета",мШкалыПриборовУчета);
	#КонецОбласти
	Возврат ОбъектСтруктура;
КонецФункции

Процедура ПроверитьРезультаты_ПодключениеУслуги_Базовый(ОбъектыВПамяти, КлючиТаблицДвижений, ТаблицыДвижений)
	
	ПроверитьНаличиеТаблиц(КлючиТаблицДвижений);
	
	ПроверитьРезультат_энргАктивностьТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргАктивностьТочекУчета].Выгрузить());
	ПроверитьРезультат_энргВидБлагоустройствАбонента_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидБлагоустройствАбонента].Выгрузить());
	ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидыДифференцированностиПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргВладельцыТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВладельцыТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргВыводПриборовУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВыводПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргГруппыПотребителейАбонентов_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргГруппыПотребителейАбонентов].Выгрузить());
	ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДатыПоверкиПрибораУчета].Выгрузить());
	ПроверитьРезультат_энргДиаметрСеченияТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДиаметрСеченияТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДифференцированностьСредствИзмерения].Выгрузить());
	//ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗарегистрированныйОбъемПриборов].Выгрузить());
	ПроверитьРезультат_энргЗначенияИзмерителейТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗначенияИзмерителейТочекУчета].Выгрузить());
	ПроверитьРезультат_энргКоэффциентыПриборовУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоэффциентыПриборовУчета].Выгрузить());
	//ПроверитьРезультат_энргМаксимальныеПоказания_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргМаксимальныеПоказания].Выгрузить());
	ПроверитьРезультат_энргНаправлениеИспользованияТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНаправлениеИспользованияТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомераСтрокСтабильногоПериодаПрочихУслуг].Выгрузить());
	ПроверитьРезультат_энргНомерПломбПриборовУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомерПломбПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоказанияПриборовУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоказанияПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоставщикиУслугАбонента_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоставщикиУслугАбонента].Выгрузить());
	ПроверитьРезультат_энргПриборыТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПриборыТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргРасчетныеСпособыТочекУчета].Выгрузить());
	ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовУчетаАбонента].Выгрузить());
	//ПроверитьРезультат_энргСостояниеПрочихУслуг_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПрочихУслуг].Выгрузить());
	//ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеСредствИзмеренияУслуг].Выгрузить());
	//ПроверитьРезультат_энргСредстваИзмеренияУслуг_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСредстваИзмеренияУслуг].Выгрузить());
	//ПроверитьРезультат_энргТарифыПрочихУслуг_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргТарифыПрочихУслуг].Выгрузить());
	ПроверитьРезультат_энргТехническаяВозможностьУстановкиПУ_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргТехническаяВозможностьУстановкиПУ].Выгрузить());
	ПроверитьРезультат_энргУслугиТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргУслугиТочекУчета].Выгрузить());
	
КонецПроцедуры

#Область ПроверкаРезультатов_ПодключениеУслуги_Базовый

Процедура ПроверитьРезультат_энргАктивностьТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	
	// Сравниваем с эталоном	
	GherkinТаблица	= 
	"Период					|Организация				|Район					|КлючПомещения					|ТочкаУчета									|Состояние										|ПериодНачисления		|ПериодРегистрации
	|'2019-12-25 01:24:01'	|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета 	|Перечисления.энргСостояниеТочекУчета.Включена	|'2019-12-01 00:00:00'	|ИсходныйОбъект.Дата";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);
 	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество()); 	
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргВидБлагоустройствАбонента_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|Услуга															|ВидБлагоустройства																		|ПериодНачисления		|ПериодРегистрации
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[0].Услуга 	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[0].ВидБлагоустройстваИндивидуальный|'2019-12-01 00:00:00'	|ИсходныйОбъект.Дата";	

	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);
 	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());	
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
КонецПроцедуры

Процедура ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ПриборУчета								|Шкала										|ВидДифференцированности								|ПериодРегистрации 	|ПериодНачисления		|ТочкаУчета
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ПриборУчета 	|ИсходныйОбъект.ШкалыПриборовУчета[0].Шкала	|Справочники.энргВидыДифференцированности.Однотарифный	|ИсходныйОбъект.Дата|'2019-12-01 00:00:00'	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета";

	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргВладельцыТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	GherkinТаблица	= 
	"Период				|Организация				|Район					|ТочкаУчета									|АбонентВладелец				|ПериодРегистрации	|ПериодНачисления
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета	|ИсходныйОбъект.КлючПомещения 	|ИсходныйОбъект.Дата|'2019-12-01 00:00:00'";

	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
КонецПроцедуры

Процедура ПроверитьРезультат_энргВыводПриборовУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргГруппыПотребителейАбонентов_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|Услуга															|ГруппаПотребителей															|ПериодРегистрации	|ПериодНачисления
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[0].Услуга 	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[0].ТарифнаяКатегория	|ИсходныйОбъект.Дата|'2019-12-01 00:00:00'";

	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
КонецПроцедуры

Процедура ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ПриборУчета								|ДатаПоверки													|ПериодРегистрации	|ПериодНачисления		|ТочкаУчета
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ПриборУчета 	|НачалоДня(ИсходныйОбъект.ТочкиУчета[0].ДатаПоверкиСчетчика)	|ИсходныйОбъект.Дата|'2019-12-01 00:00:00' 	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргДиаметрСеченияТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТочкаУчета									|Использовать 												|ДиаметрСечения								|ПериодРегистрации	|ПериодНачисления					
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета 	|ИсходныйОбъект.ТочкиУчета[0].РассчитыватьПоДиаметруСечения	|ИсходныйОбъект.ТочкиУчета[0].ДиаметрСечения|ИсходныйОбъект.Дата|'2019-12-01 00:00:00'";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
КонецПроцедуры

Процедура ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗначенияИзмерителейТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоэффциентыПриборовУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ПриборУчета								|Коэффициент|ПериодНачисления		|ПериодРегистрации	|ТочкаУчета					
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ПриборУчета	|Число(1)	|'2019-12-01 00:00:00'	|ИсходныйОбъект.Дата|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета";
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргМаксимальныеПоказания_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргНаправлениеИспользованияТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТочкаУчета								|НаправлениеИспользованияТУ																													|ПериодНачисления		|ПериодРегистрации						
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета|Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(""ab0bd74c-c894-11e9-b7f6-005056bc3fc8""))	|'2019-12-01 00:00:00'	|ИсходныйОбъект.Дата";
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомерПломбПриборовУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ПриборУчета								|НомерПломбы	|ПериодНачисления					|ПериодРегистрации						
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ПриборУчета	|""1123456""	|'2019-12-01 00:00:00'				|ИсходныйОбъект.Дата";
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоказанияПриборовУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ПриборУчета								|Шкала																															|ТарифнаяЗона																											|Разделитель|Показание	|СостояниеПоказаний							|КС		|ИсточникПоказаний									|Переворот	|ПериодНачисления		|ПериодРегистрации	|НомерСтрокиТЧ	|ТочкаУчета
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ПриборУчета	|Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(""6c919786-988b-11e9-b7f6-005056bc3fc8""))		|Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор(""96878b7a-82b3-11e9-9919-005056bc3fc8""))	|0			|Число(1)	|Перечисления.энргСостояниеПоказаний.Приняты|Ложь	|Справочники.энргИсточникиПоказаний.ПустаяСсылка()	|Ложь		|'2019-12-01 00:00:00'	|ИсходныйОбъект.Дата|2				|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета";
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоставщикиУслугАбонента_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТочкаУчета								|Услуга																													|ЧастьСоставной	|Поставщик																												|ПериодНачисления		|ПериодРегистрации	
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета|Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(""8d3582b0-c894-11e9-b7f6-005056bc3fc8""))		|Ложь			|Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(""be6da574-9bb4-11e9-b7f6-005056bc3fc8""))	|'2019-12-01 00:00:00'	|ИсходныйОбъект.Дата";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПриборыТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТочкаУчета								|ПриборУчета								|ПериодНачисления		|ПериодРегистрации	
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета|ИсходныйОбъект.ТочкиУчета[0].ПриборУчета	|'2019-12-01 00:00:00'	|ИсходныйОбъект.Дата";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТочкаУчета								|ПриборУчета								|Состояние										|ПериодНачисления		|ПериодРегистрации	
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета|ИсходныйОбъект.ТочкиУчета[0].ПриборУчета	|Перечисления.энргСостояниеПриборовУчета.Ввод	|'2019-12-01 00:00:00'	|ИсходныйОбъект.Дата";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПрочихУслуг_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСредстваИзмеренияУслуг_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргТарифыПрочихУслуг_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргТехническаяВозможностьУстановкиПУ_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТочкаУчета								|НетВозможностьУстановкиПУ	|ПериодНачисления		|ПериодРегистрации	
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета|Ложь						|'2019-12-01 00:00:00'	|ИсходныйОбъект.Дата";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргУслугиТочекУчета_ПодключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТочкаУчета								|Услуга																												|ПериодНачисления		|ПериодРегистрации	
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета|Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(""8d3582b0-c894-11e9-b7f6-005056bc3fc8""))	|'2019-12-01 00:00:00'	|ИсходныйОбъект.Дата";
	 	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Могу_Провести_ОтключениеУслуги_Базовый

Функция СоздатьОбъектВПамяти_ОтключениеУслуги_Базовый()
	#Область ВидыБлагоустройстваТарифныеКатегории
	мВидыБлагоустройстваТарифныеКатегории = Новый Массив;
	#КонецОбласти
	#Область ЗначенияИзмерителей
	мЗначенияИзмерителей = Новый Массив;
	#КонецОбласти
	#Область ПоказанияПриборовУчета
	мПоказанияПриборовУчета = Новый Массив;
	я_строка_ПоказанияПриборовУчета = Новый Структура;
	я_строка_ПоказанияПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ПоказанияПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("dd22e0c9-b938-4f67-935a-a9b94d1d4509"));
	я_строка_ПоказанияПриборовУчета.Вставить("ТарифнаяЗона",Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор("96878b7a-82b3-11e9-9919-005056bc3fc8")));
	я_строка_ПоказанияПриборовУчета.Вставить("ТекущиеПоказания",2);
	я_строка_ПоказанияПриборовУчета.Вставить("Переворот",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ДатаПоследнихПоказаний",'2019-10-25 12:00:00');
	я_строка_ПоказанияПриборовУчета.Вставить("СреднийОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Разница",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ПереворотИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("СтатусИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныеПоказания",1000000);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныйОбъемПотребления",1000);
	я_строка_ПоказанияПриборовУчета.Вставить("ЗначениеТарифа",32.14);
	я_строка_ПоказанияПриборовУчета.Вставить("Сумма",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СостояниеПоказаний",Перечисления.энргСостояниеПоказаний.Приняты);
	я_строка_ПоказанияПриборовУчета.Вставить("КоэффициентПУ",1);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредыдущиеПоказания",2);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредставлениеЗначениеТарифа","32,14");
	я_строка_ПоказанияПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСУслугами.ПолучитьСсылку(Новый УникальныйИдентификатор("10c232bf-1711-11ea-b517-005056bc3fc8")));
	мПоказанияПриборовУчета.Добавить(я_строка_ПоказанияПриборовУчета);
	#КонецОбласти
	#Область ПоставщикиСоставныхУслуг
	мПоставщикиСоставныхУслуг = Новый Массив;
	#КонецОбласти
	#Область ПрочиеУслуги
	мПрочиеУслуги = Новый Массив;
	#КонецОбласти
	#Область ТочкиУчета
	мТочкиУчета = Новый Массив;
	я_строка_ТочкиУчета = Новый Структура;
	я_строка_ТочкиУчета.Вставить("НомерСтроки",1);
	я_строка_ТочкиУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("5ad51236-794e-4aaa-8f1f-2c4a82e823bc"));
	я_строка_ТочкиУчета.Вставить("IDСтрокиРодитель",Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	я_строка_ТочкиУчета.Вставить("ДатаВыпуска",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаПоверкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиПломбы",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДиаметрСечения",0);
	я_строка_ТочкиУчета.Вставить("КоэффициентПУ",0);
	я_строка_ТочкиУчета.Вставить("НаправлениеИспользованияТУ",Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("НетВозможностьУстановкиПУ",Ложь);
	я_строка_ТочкиУчета.Вставить("НомерПломбы","");
	я_строка_ТочкиУчета.Вставить("ОписаниеПрибора","");
	я_строка_ТочкиУчета.Вставить("ОписаниеТочки","");
	я_строка_ТочкиУчета.Вставить("Поставщик",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("ПриборУчета",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("РассчитыватьПоДиаметруСечения",Ложь);
	я_строка_ТочкиУчета.Вставить("Техническая",Ложь);
	я_строка_ТочкиУчета.Вставить("ТочкаУчета",Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьВидКанальности",Справочники.энргВидыКанальности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("8d3582b0-c894-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("ЭтоСоставнаяУслуга",Ложь);
	я_строка_ТочкиУчета.Вставить("Ссылка",Документы.энргОперацияСУслугами.ПолучитьСсылку(Новый УникальныйИдентификатор("10c232bf-1711-11ea-b517-005056bc3fc8")));
	мТочкиУчета.Добавить(я_строка_ТочкиУчета);
	я_строка_ТочкиУчета = Новый Структура;
	я_строка_ТочкиУчета.Вставить("НомерСтроки",2);
	я_строка_ТочкиУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("8a5ff0c4-7b01-406b-8104-c9ccf42c0bcf"));
	я_строка_ТочкиУчета.Вставить("IDСтрокиРодитель",Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	я_строка_ТочкиУчета.Вставить("ДатаВыпуска",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаПоверкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиПломбы",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДиаметрСечения",0);
	я_строка_ТочкиУчета.Вставить("КоэффициентПУ",0);
	я_строка_ТочкиУчета.Вставить("НаправлениеИспользованияТУ",Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("НетВозможностьУстановкиПУ",Ложь);
	я_строка_ТочкиУчета.Вставить("НомерПломбы","");
	я_строка_ТочкиУчета.Вставить("ОписаниеПрибора","");
	я_строка_ТочкиУчета.Вставить("ОписаниеТочки","");
	я_строка_ТочкиУчета.Вставить("Поставщик",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("ПриборУчета",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("РассчитыватьПоДиаметруСечения",Ложь);
	я_строка_ТочкиУчета.Вставить("Техническая",Ложь);
	я_строка_ТочкиУчета.Вставить("ТочкаУчета",Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьВидКанальности",Справочники.энргВидыКанальности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("daeb5006-9d60-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("ЭтоСоставнаяУслуга",Ложь);
	я_строка_ТочкиУчета.Вставить("Ссылка",Документы.энргОперацияСУслугами.ПолучитьСсылку(Новый УникальныйИдентификатор("10c232bf-1711-11ea-b517-005056bc3fc8")));
	мТочкиУчета.Добавить(я_строка_ТочкиУчета);
	я_строка_ТочкиУчета = Новый Структура;
	я_строка_ТочкиУчета.Вставить("НомерСтроки",3);
	я_строка_ТочкиУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("803d2136-77cf-459f-bd66-5175b85844c2"));
	я_строка_ТочкиУчета.Вставить("IDСтрокиРодитель",Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	я_строка_ТочкиУчета.Вставить("ДатаВыпуска",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаПоверкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиПломбы",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДиаметрСечения",0);
	я_строка_ТочкиУчета.Вставить("КоэффициентПУ",0);
	я_строка_ТочкиУчета.Вставить("НаправлениеИспользованияТУ",Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("НетВозможностьУстановкиПУ",Ложь);
	я_строка_ТочкиУчета.Вставить("НомерПломбы","");
	я_строка_ТочкиУчета.Вставить("ОписаниеПрибора","");
	я_строка_ТочкиУчета.Вставить("ОписаниеТочки","");
	я_строка_ТочкиУчета.Вставить("Поставщик",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("ПриборУчета",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("adbe8bb3-2861-4336-82a9-e86d80006f33")));
	я_строка_ТочкиУчета.Вставить("РассчитыватьПоДиаметруСечения",Ложь);
	я_строка_ТочкиУчета.Вставить("Техническая",Ложь);
	я_строка_ТочкиУчета.Вставить("ТочкаУчета",Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьВидКанальности",Справочники.энргВидыКанальности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("8d3582b0-c894-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("ЭтоСоставнаяУслуга",Ложь);
	я_строка_ТочкиУчета.Вставить("Ссылка",Документы.энргОперацияСУслугами.ПолучитьСсылку(Новый УникальныйИдентификатор("10c232bf-1711-11ea-b517-005056bc3fc8")));
	мТочкиУчета.Добавить(я_строка_ТочкиУчета);
	#КонецОбласти
	#Область ШкалыПриборовУчета
	мШкалыПриборовУчета = Новый Массив;
	я_строка_ШкалыПриборовУчета = Новый Структура;
	я_строка_ШкалыПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ШкалыПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("dd22e0c9-b938-4f67-935a-a9b94d1d4509"));
	я_строка_ШкалыПриборовУчета.Вставить("IDСтрокиТочкиУчета",Новый УникальныйИдентификатор("803d2136-77cf-459f-bd66-5175b85844c2"));
	я_строка_ШкалыПриборовУчета.Вставить("ВидДифференцированности",Справочники.энргВидыДифференцированности.ПолучитьСсылку(Новый УникальныйИдентификатор("96878b80-82b3-11e9-9919-005056bc3fc8")));
	я_строка_ШкалыПриборовУчета.Вставить("Шкала",Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("6c919786-988b-11e9-b7f6-005056bc3fc8")));
	я_строка_ШкалыПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСУслугами.ПолучитьСсылку(Новый УникальныйИдентификатор("10c232bf-1711-11ea-b517-005056bc3fc8")));
	мШкалыПриборовУчета.Добавить(я_строка_ШкалыПриборовУчета);
	#КонецОбласти
	#Область ЗаполнениеОбъекта
	ОбъектСтруктура  = Новый Структура;
	ОбъектСтруктура.Вставить("Проведен",Истина);
	ОбъектСтруктура.Вставить("Ссылка",Документы.энргОперацияСУслугами.ПолучитьСсылку(Новый УникальныйИдентификатор("10c232bf-1711-11ea-b517-005056bc3fc8")));
	ОбъектСтруктура.Вставить("ПометкаУдаления",Ложь);
	ОбъектСтруктура.Вставить("Дата",'2019-11-01 12:00:00');
	ОбъектСтруктура.Вставить("Номер","00000000026");
	ОбъектСтруктура.Вставить("Абонент",Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор("52ece9c0-8f1b-4e6d-bf13-ac7735b0cd92")));
	ОбъектСтруктура.Вставить("ВидОперации",Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги);
	ОбъектСтруктура.Вставить("ДатаФактическогоСобытия",'0001-01-01 00:00:00');
	ОбъектСтруктура.Вставить("КлючПомещения",Справочники.энргКлючиПомещений.ПолучитьСсылку(Новый УникальныйИдентификатор("446f5419-e095-4571-ac8f-2bf5c32921f0")));
	ОбъектСтруктура.Вставить("Контроллер",Справочники.энргСотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("Организация",Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("5528dddc-9887-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("Ответственный",Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("c37ce6fe-9888-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("ПериодНачисления",'2019-11-01 12:00:00');
	ОбъектСтруктура.Вставить("Примечание","");
	ОбъектСтруктура.Вставить("Район",Справочники.энргЗоныОтвественности.ПолучитьСсылку(Новый УникальныйИдентификатор("65910a30-996e-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("УдалитьАдресОбъекта","");
	ОбъектСтруктура.Вставить("УдалитьЛицевойСчет","");
	ОбъектСтруктура.Вставить("УдалитьМКД",Справочники.энргСтроения.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("ВидыБлагоустройстваТарифныеКатегории",мВидыБлагоустройстваТарифныеКатегории);
	ОбъектСтруктура.Вставить("ЗначенияИзмерителей",мЗначенияИзмерителей);
	ОбъектСтруктура.Вставить("ПоказанияПриборовУчета",мПоказанияПриборовУчета);
	ОбъектСтруктура.Вставить("ПоставщикиСоставныхУслуг",мПоставщикиСоставныхУслуг);
	ОбъектСтруктура.Вставить("ПрочиеУслуги",мПрочиеУслуги);
	ОбъектСтруктура.Вставить("ТочкиУчета",мТочкиУчета);
	ОбъектСтруктура.Вставить("ШкалыПриборовУчета",мШкалыПриборовУчета);
	#КонецОбласти
	Возврат ОбъектСтруктура;
КонецФункции

Процедура ПроверитьРезультаты_ОтключениеУслуги_Базовый(ОбъектыВПамяти, КлючиТаблицДвижений, ТаблицыДвижений)
	
	ПроверитьНаличиеТаблиц(КлючиТаблицДвижений);
	
	ПроверитьРезультат_энргАктивностьТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргАктивностьТочекУчета].Выгрузить());
	ПроверитьРезультат_энргВидБлагоустройствАбонента_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидБлагоустройствАбонента].Выгрузить());
	ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидыДифференцированностиПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргВладельцыТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВладельцыТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргВыводПриборовУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВыводПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргГруппыПотребителейАбонентов_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргГруппыПотребителейАбонентов].Выгрузить());
	ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДатыПоверкиПрибораУчета].Выгрузить());
	ПроверитьРезультат_энргДиаметрСеченияТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДиаметрСеченияТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДифференцированностьСредствИзмерения].Выгрузить());
	//ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗарегистрированныйОбъемПриборов].Выгрузить());
	ПроверитьРезультат_энргЗначенияИзмерителейТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗначенияИзмерителейТочекУчета].Выгрузить());
	ПроверитьРезультат_энргКоэффциентыПриборовУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоэффциентыПриборовУчета].Выгрузить());
	//ПроверитьРезультат_энргМаксимальныеПоказания_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргМаксимальныеПоказания].Выгрузить());
	ПроверитьРезультат_энргНаправлениеИспользованияТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНаправлениеИспользованияТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомераСтрокСтабильногоПериодаПрочихУслуг].Выгрузить());
	ПроверитьРезультат_энргНомерПломбПриборовУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомерПломбПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоказанияПриборовУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоказанияПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоставщикиУслугАбонента_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоставщикиУслугАбонента].Выгрузить());
	ПроверитьРезультат_энргПриборыТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПриборыТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргРасчетныеСпособыТочекУчета].Выгрузить());
	ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовУчетаАбонента].Выгрузить());
	//ПроверитьРезультат_энргСостояниеПрочихУслуг_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПрочихУслуг].Выгрузить());
	//ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеСредствИзмеренияУслуг].Выгрузить());
	//ПроверитьРезультат_энргСредстваИзмеренияУслуг_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСредстваИзмеренияУслуг].Выгрузить());
	//ПроверитьРезультат_энргТарифыПрочихУслуг_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргТарифыПрочихУслуг].Выгрузить());
	ПроверитьРезультат_энргТехническаяВозможностьУстановкиПУ_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргТехническаяВозможностьУстановкиПУ].Выгрузить());
	ПроверитьРезультат_энргУслугиТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргУслугиТочекУчета].Выгрузить());	
	
КонецПроцедуры

#Область Проверка_Результатов_ОтключениеУслуги_Базовый

Процедура ПроверитьРезультат_энргАктивностьТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	// Сравниваем с эталоном	
	GherkinТаблица	= 
	"Период					|Организация				|Район					|КлючПомещения					|ТочкаУчета									|Состояние										|ПериодНачисления		|ПериодРегистрации
	|'2019-11-01 12:00:00'	|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета 	|Перечисления.энргСостояниеТочекУчета.Отключена	|'2019-11-01 00:00:00'	|ИсходныйОбъект.Дата
	|'2019-11-01 12:00:00'	|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[1].ТочкаУчета 	|Перечисления.энргСостояниеТочекУчета.Отключена	|'2019-11-01 00:00:00'	|ИсходныйОбъект.Дата
	|'2019-11-01 12:00:00'	|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета 	|Перечисления.энргСостояниеТочекУчета.Отключена	|'2019-11-01 00:00:00'	|ИсходныйОбъект.Дата";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);
 	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество()); 	
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);

КонецПроцедуры

Процедура ПроверитьРезультат_энргВидБлагоустройствАбонента_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргВладельцыТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргВыводПриборовУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргГруппыПотребителейАбонентов_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргДиаметрСеченияТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗначенияИзмерителейТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоэффциентыПриборовУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргМаксимальныеПоказания_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргНаправлениеИспользованияТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомерПломбПриборовУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоказанияПриборовУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ПриборУчета								|Шкала																															|ТарифнаяЗона																											|Разделитель|Показание	|СостояниеПоказаний							|КС		|ИсточникПоказаний									|Переворот	|ПериодНачисления		|ПериодРегистрации	|НомерСтрокиТЧ	|ТочкаУчета
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ПриборУчета	|Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(""6c919786-988b-11e9-b7f6-005056bc3fc8""))		|Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор(""96878b7a-82b3-11e9-9919-005056bc3fc8""))	|0			|Число(2)	|Перечисления.энргСостояниеПоказаний.Приняты|Ложь	|Справочники.энргИсточникиПоказаний.ПустаяСсылка()	|Ложь		|'2019-11-01 00:00:00'	|ИсходныйОбъект.Дата|1				|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета";
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоставщикиУслугАбонента_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргПриборыТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПрочихУслуг_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСредстваИзмеренияУслуг_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргТарифыПрочихУслуг_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "МетодНеРеализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргТехническаяВозможностьУстановкиПУ_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

Процедура ПроверитьРезультат_энргУслугиТочекУчета_ОтключениеУслуги_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

Процедура ПроверитьНаличиеТаблиц(КлючиТаблицДвижений)
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргАктивностьТочекУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргВидБлагоустройствАбонента")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргВидыДифференцированностиПриборовУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргВладельцыТочекУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргВыводПриборовУчета")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргГруппыПотребителейАбонентов")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргДатыПоверкиПрибораУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргДиаметрСеченияТочекУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргДифференцированностьСредствИзмерения")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргЗарегистрированныйОбъемПриборов")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргЗначенияИзмерителейТочекУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргКоэффциентыПриборовУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргМаксимальныеПоказания")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргНаправлениеИспользованияТочекУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргНомераСтрокСтабильногоПериодаПрочихУслуг")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргНомерПломбПриборовУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргПоказанияПриборовУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргПоставщикиУслугАбонента")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргПриборыТочекУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргРасчетныеСпособыТочекУчета")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСостояниеПриборовУчетаАбонента")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСостояниеПрочихУслуг")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСостояниеСредствИзмеренияУслуг")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСредстваИзмеренияУслуг")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргТарифыПрочихУслуг")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргТехническаяВозможностьУстановкиПУ")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргУслугиТочекУчета")).ЭтоИстина();
	
	Ожидаем.Что(КлючиТаблицДвижений.Количество()).Равно(17);
	
КонецПроцедуры

Функция ТаблицаПоОписаниюGherkin(Знач GherkinТаблица, Знач ИсходныйОбъект)
			
	СтрокиТаблицы						= СтрРазделить(GherkinТаблица,Символы.ПС);
	КолонкиТаблицы 						= СтрРазделить(СтрокиТаблицы[0],"|");
	ТаблицаЭталон 						= Новый ТаблицаЗначений;
	Для Сч = 0 По КолонкиТаблицы.ВГраница() Цикл
		ТаблицаЭталон.Колонки.Добавить(СокрЛП(КолонкиТаблицы[Сч]));
	КонецЦикла;
	
	Для Сч = 1 По СтрокиТаблицы.ВГраница() Цикл
		
		ДанныеСтроки 									= СтрРазделить(СтрокиТаблицы[Сч],"|",Истина);
		Если ДанныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицыЭталон  							= ТаблицаЭталон.Добавить();		
		Для Колонка = 0 По ДанныеСтроки.ВГраница() Цикл
			СтрокаТаблицыЭталон[СокрЛП(КолонкиТаблицы[Колонка])] = Вычислить(СокрЛП(ДанныеСтроки[Колонка]));  
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаЭталон;

КонецФункции

//"(ПроверитьРезультат_)(энрг.{1,})(_ПодключениеУслуги_Базовый\(ОбъектыВПамяти\, ТаблицыДвижений\[КлючиТаблицДвижений\.)(энргАктивностьТочекУчета)(\]\.Выгрузить\(\)\);)";
//"$1$2$3$2$5";