Перем КонтекстЯдра;
Перем Ожидаем;
Перем СравнениеТаблиц;

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра 		= КонтекстЯдраПараметр;
	Ожидаем 			= КонтекстЯдра.Плагин("УтвержденияBDD");
	СравнениеТаблиц 	= КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц"); 
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	НаборТестов.Добавить("Когда_Нет_НачисленногоСреднего_Тогда_НаборЗаписей_Пустой");	
КонецПроцедуры

Процедура Когда_Нет_НачисленногоСреднего_Тогда_НаборЗаписей_Пустой() Экспорт 

	Делегат  					= Обработки.слжДелегатПерерасчетСреднихНачислений.Создать();
	Делегат.МетодИнициализации 	= "Когда_Нет_НачисленногоСреднего";
	
	ИнструментОбъект  			= энргФабрикаИнструментовНачисления.ИнструментыПерерасчет();
	ИнструментОбъект.СнятьСредниеНачисления(Делегат);
	
	Ожидаем.Что(Делегат.НаборОбъемНачислений().Количество()).Равно(0); 	

КонецПроцедуры
