Перем КонтекстЯдра;
Перем Ожидаем;
Перем СравнениеТаблиц;

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра 		= КонтекстЯдраПараметр;
	Ожидаем 			= КонтекстЯдра.Плагин("УтвержденияBDD");
	СравнениеТаблиц 	= КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц"); 
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	НаборТестов.Добавить("Могу_Провести_ОткрытиеЛицевогоСчета_Базовый");
	НаборТестов.Добавить("Могу_Провести_ЗакрытиеЛицевогоСчета_Базовый");
	НаборТестов.Добавить("Могу_Провести_СменаСобственника_Базовый");
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Процедура ИнициализацияИнтерактивная() 
	
	Если ПустаяСтрока(КаталогПлагинов) Тогда
		КаталогПлагинов = "C:\Program Files (x86)\OneScript\lib\add\plugins";
	КонецЕсли;
	
	Если Ожидаем = Неопределено Тогда
		Ожидаем 			= ВнешниеОбработки.Создать(КаталогПлагинов + "\УтвержденияBDD.epf");
	КонецЕсли;

	Если СравнениеТаблиц = Неопределено Тогда
		СравнениеТаблиц 	= ВнешниеОбработки.Создать(КаталогПлагинов + "\УтвержденияПроверкаТаблиц.epf");
	КонецЕсли;
	
КонецПроцедуры

#Область Могу_Провести_ОткрытиеЛицевогоСчета_Базовый

Процедура Могу_Провести_ОткрытиеЛицевогоСчета_Базовый() Экспорт
	ИнициализацияИнтерактивная();
		
	ОбъектыВПамяти 			= Новый Массив;
	ОбъектыВПамяти.Добавить(СоздатьОбъектВПамяти_ОткрытиеЛицевогоСчета_Базовый());
	
	ДополнительныеСвойства 	= Новый Структура;
	ТаблицыПодмены 			= Новый Соответствие;
	ТаблицыПодмены.Вставить("Документ.энргОперацияСЛицевымСчетом", ОбъектыВПамяти);
	ДополнительныеСвойства.Вставить("ТаблицыПодмены", ТаблицыПодмены);
	Документы.энргОперацияСЛицевымСчетом.ИнициализироватьДанныеДокумента(ОбъектыВПамяти[0].Ссылка,ДополнительныеСвойства);
	ПроверитьРезультаты_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ДополнительныеСвойства.КлючиТаблицДвижений, ДополнительныеСвойства.ТаблицыДвижений);
	
КонецПроцедуры

Функция СоздатьОбъектВПамяти_ОткрытиеЛицевогоСчета_Базовый()	
	мЖильцы = Новый Массив;
	я_строка_Жильцы = Новый Структура;
	я_строка_Жильцы.Вставить("НомерСтроки",1);
	я_строка_Жильцы.Вставить("ФизическоеЛицо",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("2fb489bb-daaf-11e9-b7f6-005056bc3fc8")));
	я_строка_Жильцы.Вставить("ДоляСобственности",0);
	я_строка_Жильцы.Вставить("СвидетельствоОРегистрацииНомер","");
	я_строка_Жильцы.Вставить("СвидетельствоОРегистрацииДата",'0001-01-01 00:00:00');
	я_строка_Жильцы.Вставить("СвидетельствоОРегистрацииСерия","");
	я_строка_Жильцы.Вставить("ДоляСобственностиЧислитель",1);
	я_строка_Жильцы.Вставить("ДоляСобственностиЗнаменатель",1);
	я_строка_Жильцы.Вставить("СвидетельствоОРегистрацииКемВыдан","");
	я_строка_Жильцы.Вставить("ЛьготнаяКатегория",Справочники.энргЛьготныеКатегории.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_Жильцы.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мЖильцы.Добавить(я_строка_Жильцы);
	мЗначениеПлощадей = Новый Массив;
	я_строка_ЗначениеПлощадей = Новый Структура;
	я_строка_ЗначениеПлощадей.Вставить("НомерСтроки",1);
	я_строка_ЗначениеПлощадей.Вставить("ВидПлощади",Перечисления.энргВидыПлощадей.ОбщаяПлощадь);
	я_строка_ЗначениеПлощадей.Вставить("Значение",128.6);
	я_строка_ЗначениеПлощадей.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мЗначениеПлощадей.Добавить(я_строка_ЗначениеПлощадей);
	я_строка_ЗначениеПлощадей = Новый Структура;
	я_строка_ЗначениеПлощадей.Вставить("НомерСтроки",2);
	я_строка_ЗначениеПлощадей.Вставить("ВидПлощади",Перечисления.энргВидыПлощадей.ЖилаяПлощадь);
	я_строка_ЗначениеПлощадей.Вставить("Значение",128.6);
	я_строка_ЗначениеПлощадей.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мЗначениеПлощадей.Добавить(я_строка_ЗначениеПлощадей);
	мПоказанияПриборовУчета = Новый Массив;
	я_строка_ПоказанияПриборовУчета = Новый Структура;
	я_строка_ПоказанияПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ПоказанияПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("3551b341-b076-4e5e-b21b-97071e0c5236"));
	я_строка_ПоказанияПриборовУчета.Вставить("ДатаПоследнихПоказаний",'0001-01-01 00:00:00');
	я_строка_ПоказанияПриборовУчета.Вставить("ЗначениеТарифа",0);
	я_строка_ПоказанияПриборовУчета.Вставить("КоэффициентПУ",0);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныйОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Переворот",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПереворотИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредыдущиеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Разница",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СостояниеПоказаний",Перечисления.энргСостояниеПоказаний.ПустаяСсылка());
	я_строка_ПоказанияПриборовУчета.Вставить("СреднийОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СтатусИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("Сумма",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ТарифнаяЗона",Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор("96878b7a-82b3-11e9-9919-005056bc3fc8")));
	я_строка_ПоказанияПриборовУчета.Вставить("ТекущиеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредставлениеЗначениеТарифа","");
	я_строка_ПоказанияПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мПоказанияПриборовУчета.Добавить(я_строка_ПоказанияПриборовУчета);
	я_строка_ПоказанияПриборовУчета = Новый Структура;
	я_строка_ПоказанияПриборовУчета.Вставить("НомерСтроки",2);
	я_строка_ПоказанияПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("6d6d2bea-1258-48b8-a314-79dee0e67a75"));
	я_строка_ПоказанияПриборовУчета.Вставить("ДатаПоследнихПоказаний",'0001-01-01 00:00:00');
	я_строка_ПоказанияПриборовУчета.Вставить("ЗначениеТарифа",0);
	я_строка_ПоказанияПриборовУчета.Вставить("КоэффициентПУ",0);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныйОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Переворот",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПереворотИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредыдущиеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Разница",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СостояниеПоказаний",Перечисления.энргСостояниеПоказаний.ПустаяСсылка());
	я_строка_ПоказанияПриборовУчета.Вставить("СреднийОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СтатусИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("Сумма",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ТарифнаяЗона",Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор("96878b7a-82b3-11e9-9919-005056bc3fc8")));
	я_строка_ПоказанияПриборовУчета.Вставить("ТекущиеПоказания",219);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредставлениеЗначениеТарифа","");
	я_строка_ПоказанияПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мПоказанияПриборовУчета.Добавить(я_строка_ПоказанияПриборовУчета);
	я_строка_ПоказанияПриборовУчета = Новый Структура;
	я_строка_ПоказанияПриборовУчета.Вставить("НомерСтроки",3);
	я_строка_ПоказанияПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("0ab2df23-e547-48a5-84d8-030e56fdff7a"));
	я_строка_ПоказанияПриборовУчета.Вставить("ДатаПоследнихПоказаний",'0001-01-01 00:00:00');
	я_строка_ПоказанияПриборовУчета.Вставить("ЗначениеТарифа",0);
	я_строка_ПоказанияПриборовУчета.Вставить("КоэффициентПУ",0);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныйОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Переворот",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПереворотИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредыдущиеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Разница",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СостояниеПоказаний",Перечисления.энргСостояниеПоказаний.ПустаяСсылка());
	я_строка_ПоказанияПриборовУчета.Вставить("СреднийОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СтатусИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("Сумма",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ТарифнаяЗона",Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор("96878b7a-82b3-11e9-9919-005056bc3fc8")));
	я_строка_ПоказанияПриборовУчета.Вставить("ТекущиеПоказания",924);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредставлениеЗначениеТарифа","");
	я_строка_ПоказанияПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мПоказанияПриборовУчета.Добавить(я_строка_ПоказанияПриборовУчета);
	мПоставщикиСоставныхУслуг = Новый Массив;
	я_строка_ПоставщикиСоставныхУслуг = Новый Структура;
	я_строка_ПоставщикиСоставныхУслуг.Вставить("НомерСтроки",1);
	я_строка_ПоставщикиСоставныхУслуг.Вставить("IDСтроки",Новый УникальныйИдентификатор("9b69484b-5c63-43c2-9c42-7aac69c84d7a"));
	я_строка_ПоставщикиСоставныхУслуг.Вставить("ЧастьСоставнойУслуги",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("8d3582b0-c894-11e9-b7f6-005056bc3fc8")));
	я_строка_ПоставщикиСоставныхУслуг.Вставить("Поставщик",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("be6da574-9bb4-11e9-b7f6-005056bc3fc8")));
	я_строка_ПоставщикиСоставныхУслуг.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мПоставщикиСоставныхУслуг.Добавить(я_строка_ПоставщикиСоставныхУслуг);
	я_строка_ПоставщикиСоставныхУслуг = Новый Структура;
	я_строка_ПоставщикиСоставныхУслуг.Вставить("НомерСтроки",2);
	я_строка_ПоставщикиСоставныхУслуг.Вставить("IDСтроки",Новый УникальныйИдентификатор("9b69484b-5c63-43c2-9c42-7aac69c84d7a"));
	я_строка_ПоставщикиСоставныхУслуг.Вставить("ЧастьСоставнойУслуги",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("daeb5006-9d60-11e9-b7f6-005056bc3fc8")));
	я_строка_ПоставщикиСоставныхУслуг.Вставить("Поставщик",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("be6da574-9bb4-11e9-b7f6-005056bc3fc8")));
	я_строка_ПоставщикиСоставныхУслуг.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мПоставщикиСоставныхУслуг.Добавить(я_строка_ПоставщикиСоставныхУслуг);
	мПрочиеУслуги = Новый Массив;
	мТочкиУчета = Новый Массив;
	я_строка_ТочкиУчета = Новый Структура;
	я_строка_ТочкиУчета.Вставить("НомерСтроки",1);
	я_строка_ТочкиУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("8a37950d-dd37-42ed-b29e-b4c6994ec99d"));
	я_строка_ТочкиУчета.Вставить("IDСтрокиРодитель",Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	я_строка_ТочкиУчета.Вставить("ДатаПоверкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаПриемки",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиПломбы",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДиаметрСечения",0);
	я_строка_ТочкиУчета.Вставить("КоэффициентПУ",0);
	я_строка_ТочкиУчета.Вставить("НаправлениеИспользованияТУ",Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("6c919776-988b-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("НетВозможностьУстановкиПУ",Ложь);
	я_строка_ТочкиУчета.Вставить("НомерПломбы","");
	я_строка_ТочкиУчета.Вставить("ОписаниеПрибора","");
	я_строка_ТочкиУчета.Вставить("ОписаниеТочки","{
	|""НаименованиеТочки"": ""ввод_Отопление"",
	|""Расположение"": ""39264ff7-be35-11e9-b7f6-005056bc3fc8"",
	|""Головная"": false
	|}");
	я_строка_ТочкиУчета.Вставить("Поставщик",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("be6da574-9bb4-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("ПриборУчета",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("РассчитыватьПоДиаметруСечения",Ложь);
	я_строка_ТочкиУчета.Вставить("СтруктураСети",Справочники.бестСтруктураСети.ПолучитьСсылку(Новый УникальныйИдентификатор("8288e726-9e25-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("Техническая",Ложь);
	я_строка_ТочкиУчета.Вставить("ТочкаУчета",Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("1540cbee-d0ce-4e81-a2f9-ce36a856e3fb")));
	я_строка_ТочкиУчета.Вставить("УдалитьВидКанальности",Справочники.энргВидыКанальности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьГоловная",Ложь);
	я_строка_ТочкиУчета.Вставить("УдалитьДатаПоследнихПоказаний",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("УдалитьЗаводскойНомер","");
	я_строка_ТочкиУчета.Вставить("УдалитьНаименованиеТочки","");
	я_строка_ТочкиУчета.Вставить("УдалитьРасположение",Справочники.энргМестаРасположенияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьТипПрибораУчета",Справочники.энргТипыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("c52e09c7-9bdb-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("Энергоназначение",Перечисления.энргВидыЭнергоназначений.ПустаяСсылка());
	я_строка_ТочкиУчета.Вставить("ЭтоСоставнаяУслуга",Ложь);
	я_строка_ТочкиУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мТочкиУчета.Добавить(я_строка_ТочкиУчета);
	я_строка_ТочкиУчета = Новый Структура;
	я_строка_ТочкиУчета.Вставить("НомерСтроки",2);
	я_строка_ТочкиУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("5594bf14-9a35-4772-8b86-8a6d995262c3"));
	я_строка_ТочкиУчета.Вставить("IDСтрокиРодитель",Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	я_строка_ТочкиУчета.Вставить("ДатаПоверкиСчетчика",'2023-04-12 12:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаПриемки",'2019-09-01 12:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиПломбы",'2019-09-01 12:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДиаметрСечения",0);
	я_строка_ТочкиУчета.Вставить("КоэффициентПУ",0);
	я_строка_ТочкиУчета.Вставить("НаправлениеИспользованияТУ",Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("9734f2d0-c258-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("НетВозможностьУстановкиПУ",Ложь);
	я_строка_ТочкиУчета.Вставить("НомерПломбы","22222");
	я_строка_ТочкиУчета.Вставить("ОписаниеПрибора","{
	|""ЗаводскойНомер"": ""1011055315307"",
	|""РегистрируетОбъем"": ""Нет"",
	|""ТипПрибораУчета"": ""66c91ec8-c971-11e9-b7f6-005056bc3fc8"",
	|""ВидКанальности"": ""6c919768-988b-11e9-b7f6-005056bc3fc8""
	|}");
	я_строка_ТочкиУчета.Вставить("ОписаниеТочки","{
	|""НаименованиеТочки"": ""с/у_Холодное водоснабжение"",
	|""Расположение"": ""2f20dcc8-d9bb-11e9-b7f6-005056bc3fc8"",
	|""Головная"": false
	|}");
	я_строка_ТочкиУчета.Вставить("Поставщик",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("be6da574-9bb4-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("ПриборУчета",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("c7d16660-9bb2-4f4a-b963-9022280bc26f")));
	я_строка_ТочкиУчета.Вставить("РассчитыватьПоДиаметруСечения",Ложь);
	я_строка_ТочкиУчета.Вставить("СтруктураСети",Справочники.бестСтруктураСети.ПолучитьСсылку(Новый УникальныйИдентификатор("c4b8e380-a12c-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("Техническая",Истина);
	я_строка_ТочкиУчета.Вставить("ТочкаУчета",Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("72b2ee1c-3f41-425c-8ddf-09c308235868")));
	я_строка_ТочкиУчета.Вставить("УдалитьВидКанальности",Справочники.энргВидыКанальности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьГоловная",Ложь);
	я_строка_ТочкиУчета.Вставить("УдалитьДатаПоследнихПоказаний",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("УдалитьЗаводскойНомер","");
	я_строка_ТочкиУчета.Вставить("УдалитьНаименованиеТочки","");
	я_строка_ТочкиУчета.Вставить("УдалитьРасположение",Справочники.энргМестаРасположенияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьТипПрибораУчета",Справочники.энргТипыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("8d3582b0-c894-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("Энергоназначение",Перечисления.энргВидыЭнергоназначений.ПустаяСсылка());
	я_строка_ТочкиУчета.Вставить("ЭтоСоставнаяУслуга",Ложь);
	я_строка_ТочкиУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мТочкиУчета.Добавить(я_строка_ТочкиУчета);
	я_строка_ТочкиУчета = Новый Структура;
	я_строка_ТочкиУчета.Вставить("НомерСтроки",3);
	я_строка_ТочкиУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("9b69484b-5c63-43c2-9c42-7aac69c84d7a"));
	я_строка_ТочкиУчета.Вставить("IDСтрокиРодитель",Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	я_строка_ТочкиУчета.Вставить("ДатаПоверкиСчетчика",'2023-04-12 12:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаПриемки",'2019-09-01 12:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиПломбы",'2019-09-01 12:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДиаметрСечения",0);
	я_строка_ТочкиУчета.Вставить("КоэффициентПУ",1);
	я_строка_ТочкиУчета.Вставить("НаправлениеИспользованияТУ",Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("6c919776-988b-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("НетВозможностьУстановкиПУ",Ложь);
	я_строка_ТочкиУчета.Вставить("НомерПломбы","1111111");
	я_строка_ТочкиУчета.Вставить("ОписаниеПрибора","{
	|""ЗаводскойНомер"": ""25790996"",
	|""РегистрируетОбъем"": ""Нет"",
	|""ТипПрибораУчета"": ""a613bdaa-cec2-11e9-b7f6-005056bc3fc8"",
	|""ВидКанальности"": ""6c919768-988b-11e9-b7f6-005056bc3fc8""
	|}");
	я_строка_ТочкиУчета.Вставить("ОписаниеТочки","{
	|""НаименованиеТочки"": ""с/у_ХВС + водоотведение"",
	|""Расположение"": ""2f20dcc8-d9bb-11e9-b7f6-005056bc3fc8"",
	|""Головная"": false
	|}");
	я_строка_ТочкиУчета.Вставить("Поставщик",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("be6da574-9bb4-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("ПриборУчета",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("be29e84f-83ab-405f-b5d4-06fef4162c22")));
	я_строка_ТочкиУчета.Вставить("РассчитыватьПоДиаметруСечения",Ложь);
	я_строка_ТочкиУчета.Вставить("СтруктураСети",Справочники.бестСтруктураСети.ПолучитьСсылку(Новый УникальныйИдентификатор("c4b8e380-a12c-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("Техническая",Ложь);
	я_строка_ТочкиУчета.Вставить("ТочкаУчета",Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("b315a642-3a4e-4e4f-8e79-2c59a68a7925")));
	я_строка_ТочкиУчета.Вставить("УдалитьВидКанальности",Справочники.энргВидыКанальности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьГоловная",Ложь);
	я_строка_ТочкиУчета.Вставить("УдалитьДатаПоследнихПоказаний",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("УдалитьЗаводскойНомер","");
	я_строка_ТочкиУчета.Вставить("УдалитьНаименованиеТочки","");
	я_строка_ТочкиУчета.Вставить("УдалитьРасположение",Справочники.энргМестаРасположенияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьТипПрибораУчета",Справочники.энргТипыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("75793644-c96b-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("Энергоназначение",Перечисления.энргВидыЭнергоназначений.ПустаяСсылка());
	я_строка_ТочкиУчета.Вставить("ЭтоСоставнаяУслуга",Истина);
	я_строка_ТочкиУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мТочкиУчета.Добавить(я_строка_ТочкиУчета);
	я_строка_ТочкиУчета = Новый Структура;
	я_строка_ТочкиУчета.Вставить("НомерСтроки",4);
	я_строка_ТочкиУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("abad7457-b94c-4d98-a854-cb268b9a4493"));
	я_строка_ТочкиУчета.Вставить("IDСтрокиРодитель",Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	я_строка_ТочкиУчета.Вставить("ДатаПоверкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаПриемки",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиПломбы",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДиаметрСечения",0);
	я_строка_ТочкиУчета.Вставить("КоэффициентПУ",0);
	я_строка_ТочкиУчета.Вставить("НаправлениеИспользованияТУ",Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("6c919776-988b-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("НетВозможностьУстановкиПУ",Ложь);
	я_строка_ТочкиУчета.Вставить("НомерПломбы","");
	я_строка_ТочкиУчета.Вставить("ОписаниеПрибора","");
	я_строка_ТочкиУчета.Вставить("ОписаниеТочки","{
	|""НаименованиеТочки"": ""*_Водоотведение"",
	|""Расположение"": ""c41b745e-db76-11e9-b7f6-005056bc3fc8"",
	|""Головная"": false
	|}");
	я_строка_ТочкиУчета.Вставить("Поставщик",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("be6da574-9bb4-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("ПриборУчета",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("РассчитыватьПоДиаметруСечения",Ложь);
	я_строка_ТочкиУчета.Вставить("СтруктураСети",Справочники.бестСтруктураСети.ПолучитьСсылку(Новый УникальныйИдентификатор("c4b8e380-a12c-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("Техническая",Ложь);
	я_строка_ТочкиУчета.Вставить("ТочкаУчета",Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("653e7af6-72f3-4e0a-8fa4-49aa0b2caf81")));
	я_строка_ТочкиУчета.Вставить("УдалитьВидКанальности",Справочники.энргВидыКанальности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьГоловная",Ложь);
	я_строка_ТочкиУчета.Вставить("УдалитьДатаПоследнихПоказаний",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("УдалитьЗаводскойНомер","");
	я_строка_ТочкиУчета.Вставить("УдалитьНаименованиеТочки","");
	я_строка_ТочкиУчета.Вставить("УдалитьРасположение",Справочники.энргМестаРасположенияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьТипПрибораУчета",Справочники.энргТипыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("daeb5006-9d60-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("Энергоназначение",Перечисления.энргВидыЭнергоназначений.ПустаяСсылка());
	я_строка_ТочкиУчета.Вставить("ЭтоСоставнаяУслуга",Ложь);
	я_строка_ТочкиУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мТочкиУчета.Добавить(я_строка_ТочкиУчета);
	мВидыБлагоустройств = Новый Массив;
	мШкалыПриборовУчета = Новый Массив;
	я_строка_ШкалыПриборовУчета = Новый Структура;
	я_строка_ШкалыПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ШкалыПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("3551b341-b076-4e5e-b21b-97071e0c5236"));
	я_строка_ШкалыПриборовУчета.Вставить("IDСтрокиТочкиУчета",Новый УникальныйИдентификатор("8a37950d-dd37-42ed-b29e-b4c6994ec99d"));
	я_строка_ШкалыПриборовУчета.Вставить("ВидДифференцированности",Справочники.энргВидыДифференцированности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ШкалыПриборовУчета.Вставить("Шкала",Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("3bc33a05-bf34-11e9-b7f6-005056bc3fc8")));
	я_строка_ШкалыПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мШкалыПриборовУчета.Добавить(я_строка_ШкалыПриборовУчета);
	я_строка_ШкалыПриборовУчета = Новый Структура;
	я_строка_ШкалыПриборовУчета.Вставить("НомерСтроки",2);
	я_строка_ШкалыПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("6d6d2bea-1258-48b8-a314-79dee0e67a75"));
	я_строка_ШкалыПриборовУчета.Вставить("IDСтрокиТочкиУчета",Новый УникальныйИдентификатор("5594bf14-9a35-4772-8b86-8a6d995262c3"));
	я_строка_ШкалыПриборовУчета.Вставить("ВидДифференцированности",Справочники.энргВидыДифференцированности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ШкалыПриборовУчета.Вставить("Шкала",Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("6c919786-988b-11e9-b7f6-005056bc3fc8")));
	я_строка_ШкалыПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мШкалыПриборовУчета.Добавить(я_строка_ШкалыПриборовУчета);
	я_строка_ШкалыПриборовУчета = Новый Структура;
	я_строка_ШкалыПриборовУчета.Вставить("НомерСтроки",3);
	я_строка_ШкалыПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("0ab2df23-e547-48a5-84d8-030e56fdff7a"));
	я_строка_ШкалыПриборовУчета.Вставить("IDСтрокиТочкиУчета",Новый УникальныйИдентификатор("9b69484b-5c63-43c2-9c42-7aac69c84d7a"));
	я_строка_ШкалыПриборовУчета.Вставить("ВидДифференцированности",Справочники.энргВидыДифференцированности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ШкалыПриборовУчета.Вставить("Шкала",Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("6c919786-988b-11e9-b7f6-005056bc3fc8")));
	я_строка_ШкалыПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мШкалыПриборовУчета.Добавить(я_строка_ШкалыПриборовУчета);
	мВидыБлагоустройстваТарифныеКатегории = Новый Массив;
	я_строка_ВидыБлагоустройстваТарифныеКатегории = Новый Структура;
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("НомерСтроки",1);
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("c52e09c7-9bdb-11e9-b7f6-005056bc3fc8")));
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("ВидБлагоустройстваИндивидуальный",Справочники.энргВидыБлагоустройств.ПолучитьСсылку(Новый УникальныйИдентификатор("fb0177d0-9ca9-11e9-b7f6-005056bc3fc8")));
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("ТарифнаяКатегория",Справочники.энргГруппыПотребителей.ПолучитьСсылку(Новый УникальныйИдентификатор("0bc19e45-d541-11e9-b7f6-005056bc3fc8")));
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мВидыБлагоустройстваТарифныеКатегории.Добавить(я_строка_ВидыБлагоустройстваТарифныеКатегории);
	я_строка_ВидыБлагоустройстваТарифныеКатегории = Новый Структура;
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("НомерСтроки",2);
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("8d3582b0-c894-11e9-b7f6-005056bc3fc8")));
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("ВидБлагоустройстваИндивидуальный",Справочники.энргВидыБлагоустройств.ПолучитьСсылку(Новый УникальныйИдентификатор("bce82cd6-c895-11e9-b7f6-005056bc3fc8")));
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("ТарифнаяКатегория",Справочники.энргГруппыПотребителей.ПолучитьСсылку(Новый УникальныйИдентификатор("0bc19e45-d541-11e9-b7f6-005056bc3fc8")));
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мВидыБлагоустройстваТарифныеКатегории.Добавить(я_строка_ВидыБлагоустройстваТарифныеКатегории);
	я_строка_ВидыБлагоустройстваТарифныеКатегории = Новый Структура;
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("НомерСтроки",3);
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("daeb5006-9d60-11e9-b7f6-005056bc3fc8")));
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("ВидБлагоустройстваИндивидуальный",Справочники.энргВидыБлагоустройств.ПолучитьСсылку(Новый УникальныйИдентификатор("bce82cd6-c895-11e9-b7f6-005056bc3fc8")));
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("ТарифнаяКатегория",Справочники.энргГруппыПотребителей.ПолучитьСсылку(Новый УникальныйИдентификатор("0bc19e45-d541-11e9-b7f6-005056bc3fc8")));
	я_строка_ВидыБлагоустройстваТарифныеКатегории.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	мВидыБлагоустройстваТарифныеКатегории.Добавить(я_строка_ВидыБлагоустройстваТарифныеКатегории);
	мЗначенияИзмерителей = Новый Массив;
	
	ОбъектСтруктура  = Новый Структура;
	ОбъектСтруктура.Вставить("Проведен",Истина);
	ОбъектСтруктура.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("61ea1530-dab0-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("ПометкаУдаления",Ложь);
	ОбъектСтруктура.Вставить("Дата",'2019-09-01 12:00:06');
	ОбъектСтруктура.Вставить("Номер","00000000084");
	ОбъектСтруктура.Вставить("Абонент",Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор("65b98e80-a7cb-4813-8d28-28a166d57103")));
	ОбъектСтруктура.Вставить("АбонентСмена",Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("бестПостановление",Перечисления.бестРабочиеПостановления.Постановление354);
	ОбъектСтруктура.Вставить("бестПричинаЗакрытияЛС",Справочники.энргПричинаЗакрытияЛС.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("бестСпособДоставкиЕПД",Справочники.бестСпособыДоставкиЕПД.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("ВидОперации",Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС);
	ОбъектСтруктура.Вставить("ГруппаАбонента",Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор("8320c019-be47-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("ГруппаПотребителей",Справочники.энргГруппыПотребителей.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("ДатаДоговораСоцНайма",'0001-01-01 00:00:00');
	ОбъектСтруктура.Вставить("ДатаФактическогоСобытия",'0001-01-01 00:00:00');
	ОбъектСтруктура.Вставить("Договор",Справочники.бестДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор("f05ba0ff-daaf-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("Домовладение",Ложь);
	ОбъектСтруктура.Вставить("КлючПомещения",Справочники.энргКлючиПомещений.ПолучитьСсылку(Новый УникальныйИдентификатор("ec108793-eacb-4301-8865-cf2bd2aee16d")));
	ОбъектСтруктура.Вставить("КоличествоКомнат",4);
	ОбъектСтруктура.Вставить("КоличествоПроживающих",3);
	ОбъектСтруктура.Вставить("КоличествоПрописанных",2);
	ОбъектСтруктура.Вставить("КоличествоСобственников",1);
	ОбъектСтруктура.Вставить("Контроллер",Справочники.энргСотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор("40503111-be4e-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("МаршрутКонтроллера",Справочники.энргМаршрутыКонтроллеров.ПолучитьСсылку(Новый УникальныйИдентификатор("5e271e45-be4e-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("НомерДоговораСоцНайма","");
	ОбъектСтруктура.Вставить("ОписаниеАбонента","{
	|""ФизЛицо"": ""2fb489bb-daaf-11e9-b7f6-005056bc3fc8"",
	|""ОКТМО"": """",
	|""ВидОбъекта"": ""6c919769-988b-11e9-b7f6-005056bc3fc8"",
	|""МуниципальноеОбразование"": ""00000000-0000-0000-0000-000000000000"",
	|""АдресОбъекта"": ""652425, Кемеровская обл, Городской округ Березовский, Лазурная ул, дом № 21"",
	|""АдресОбъектаЗначение"": ""{\r\n\""value\"": \""652425, Кемеровская обл, Городской округ Березовский, Лазурная ул, дом № 21\"",\r\n\""comment\"": \""\"",\r\n\""type\"": \""Адрес\"",\r\n\""country\"": \""РОССИЯ\"",\r\n\""addressType\"": \""Муниципальный\"",\r\n\""countryCode\"": \""\"",\r\n\""ZIPcode\"": \""652425\"",\r\n\""area\"": \""\"",\r\n\""areaType\"": \""\"",\r\n\""city\"": \""\"",\r\n\""cityType\"": \""\"",\r\n\""street\"": \""Кемеровская обл, Городской округ Березовский, Лазурная ул, дом 21\"",\r\n\""streetType\"": \""\"",\r\n\""id\"": \""\"",\r\n\""areaCode\"": \""\"",\r\n\""areaId\"": \""\"",\r\n\""district\"": \""\"",\r\n\""districtType\"": \""\"",\r\n\""districtId\"": \""\"",\r\n\""munDistrict\"": \""\"",\r\n\""munDistrictType\"": \""\"",\r\n\""munDistrictId\"": \""\"",\r\n\""cityId\"": \""\"",\r\n\""settlement\"": \""\"",\r\n\""settlementType\"": \""\"",\r\n\""settlementId\"": \""\"",\r\n\""cityDistrict\"": \""\"",\r\n\""cityDistrictType\"": \""\"",\r\n\""cityDistrictId\"": \""\"",\r\n\""territory\"": \""\"",\r\n\""territoryType\"": \""\"",\r\n\""territoryId\"": \""\"",\r\n\""locality\"": \""\"",\r\n\""localityType\"": \""\"",\r\n\""localityId\"": \""\"",\r\n\""streetId\"": \""\"",\r\n\""houseType\"": \""\"",\r\n\""houseNumber\"": \""\"",\r\n\""houseId\"": \""\"",\r\n\""buildings\"": [],\r\n\""apartments\"": [],\r\n\""codeKLADR\"": \""\"",\r\n\""oktmo\"": \""\"",\r\n\""okato\"": \""\"",\r\n\""asInDocument\"": \""\"",\r\n\""ifnsFLCode\"": \""\"",\r\n\""ifnsULCode\"": \""\"",\r\n\""ifnsFLAreaCode\"": \""\"",\r\n\""ifnsULAreaCode\"": \""\"",\r\n\""stead\"": \""\"",\r\n\""steadId\"": \""\""\r\n}"",
	|""Филиал"": ""2172a9ac-996c-11e9-b7f6-005056bc3fc8""
	|}");
	ОбъектСтруктура.Вставить("Организация",Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("5528dddc-9887-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("Основание",Неопределено);
	ОбъектСтруктура.Вставить("Ответственный",Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("a45f4e5a-27c8-11ea-aa28-902b34cfd89e")));
	ОбъектСтруктура.Вставить("ПериодНачисления",'2019-09-01 00:00:00');
	ОбъектСтруктура.Вставить("Примечание","");
	ОбъектСтруктура.Вставить("Район",Справочники.энргЗоныОтвественности.ПолучитьСсылку(Новый УникальныйИдентификатор("65910a30-996e-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("СтарыйЛС","");
	ОбъектСтруктура.Вставить("ТипПлиты",Перечисления.энргТипыПлит.ПустаяСсылка());
	ОбъектСтруктура.Вставить("ТипСобственностиЖилья",Перечисления.энргТипыСобственниковЖилья.ЧастнаяСобственность);
	ОбъектСтруктура.Вставить("УдалитьАдресОбъекта","");
	ОбъектСтруктура.Вставить("УдалитьАдресОбъектаПредставлениеПолей","");
	ОбъектСтруктура.Вставить("УдалитьВидБлагоустройства",Справочники.энргВидыБлагоустройств.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("УдалитьВидОбъекта",Справочники.энргВидыОбъектовАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("УдалитьЛицевойСчет","                  ");
	ОбъектСтруктура.Вставить("УдалитьМКД",Справочники.энргСтроения.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("УдалитьМуниципальноеОбразование",Справочники.энргМуниципальноеОбразование.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("УдалитьОКТМО","");
	ОбъектСтруктура.Вставить("УдалитьПлощадь",0);
	ОбъектСтруктура.Вставить("УдалитьФизЛицо",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("Жильцы",мЖильцы);
	ОбъектСтруктура.Вставить("ЗначениеПлощадей",мЗначениеПлощадей);
	ОбъектСтруктура.Вставить("ПоказанияПриборовУчета",мПоказанияПриборовУчета);
	ОбъектСтруктура.Вставить("ПоставщикиСоставныхУслуг",мПоставщикиСоставныхУслуг);
	ОбъектСтруктура.Вставить("ПрочиеУслуги",мПрочиеУслуги);
	ОбъектСтруктура.Вставить("ТочкиУчета",мТочкиУчета);
	ОбъектСтруктура.Вставить("ВидыБлагоустройств",мВидыБлагоустройств);
	ОбъектСтруктура.Вставить("ШкалыПриборовУчета",мШкалыПриборовУчета);
	ОбъектСтруктура.Вставить("ВидыБлагоустройстваТарифныеКатегории",мВидыБлагоустройстваТарифныеКатегории);
	ОбъектСтруктура.Вставить("ЗначенияИзмерителей",мЗначенияИзмерителей);
	Возврат ОбъектСтруктура;
КонецФункции

Процедура ПроверитьРезультаты_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, КлючиТаблицДвижений, ТаблицыДвижений)
	
	ПроверитьНаличиеТаблиц(КлючиТаблицДвижений);
	
	ПроверитьРезультат_энргАктивностьТочекУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргАктивностьТочекУчета].Выгрузить());
	ПроверитьРезультат_энргВидБлагоустройствАбонента_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидБлагоустройствАбонента].Выгрузить());
	ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидыДифференцированностиПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргВладельцыТочекУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВладельцыТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргВыводПриборовУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВыводПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргГруппыПотребителейАбонентов_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргГруппыПотребителейАбонентов].Выгрузить());
	ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДатыПоверкиПрибораУчета].Выгрузить());
	ПроверитьРезультат_энргДиаметрСеченияТочекУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДиаметрСеченияТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДифференцированностьСредствИзмерения].Выгрузить());
	//ПроверитьРезультат_энргЖильцыЛьготныхКатегорий_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЖильцыЛьготныхКатегорий].Выгрузить());
	//ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗарегистрированныйОбъемПриборов].Выгрузить());
	ПроверитьРезультат_энргЗначенияИзмерителейТочекУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗначенияИзмерителейТочекУчета].Выгрузить());
	ПроверитьРезультат_энргЗначенияПлощадей_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗначенияПлощадей].Выгрузить());
	//ПроверитьРезультат_энргКоличествоЖильцов_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоличествоЖильцов].Выгрузить());
	ПроверитьРезультат_энргКоличествоКомнат_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоличествоКомнат].Выгрузить());
	ПроверитьРезультат_энргКоличествоПроживающих_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоличествоПроживающих].Выгрузить());
	ПроверитьРезультат_энргКоличествоПрописанных_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоличествоПрописанных].Выгрузить());
	ПроверитьРезультат_энргКоличествоСобственников_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоличествоСобственников].Выгрузить());
	ПроверитьРезультат_энргКоэффциентыПриборовУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоэффциентыПриборовУчета].Выгрузить());
	//ПроверитьРезультат_энргМаксимальныеПоказания_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргМаксимальныеПоказания].Выгрузить());
	ПроверитьРезультат_энргНаправлениеИспользованияТочекУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНаправлениеИспользованияТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомераСтрокСтабильногоПериодаПрочихУслуг].Выгрузить());
	ПроверитьРезультат_энргНомерПломбПриборовУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомерПломбПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоказанияПриборовУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоказанияПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоставщикиУслугАбонента_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоставщикиУслугАбонента].Выгрузить());
	ПроверитьРезультат_энргПриборыТочекУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПриборыТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргПриборыУзловУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПриборыУзловУчета].Выгрузить());
	//ПроверитьРезультат_энргПроживаниеЖильцов_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПроживаниеЖильцов].Выгрузить());
	ПроверитьРезультат_энргСостояниеЛС_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеЛС].Выгрузить());
	//ПроверитьРезультат_энргСостояниеПриборовМКД_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовМКД].Выгрузить());
	//ПроверитьРезультат_энргСостояниеПриборовУзловУчетаАбонента_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовУзловУчетаАбонента].Выгрузить());
	ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовУчетаАбонента].Выгрузить());
	//ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеСредствИзмеренияУслуг].Выгрузить());
	//ПроверитьРезультат_энргСредстваИзмеренияУслуг_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСредстваИзмеренияУслуг].Выгрузить());
	ПроверитьРезультат_энргТехническаяВозможностьУстановкиПУ_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргТехническаяВозможностьУстановкиПУ].Выгрузить());
	ПроверитьРезультат_энргТипСобственностиАбонентов_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргТипСобственностиАбонентов].Выгрузить());
	ПроверитьРезультат_энргУслугиТочекУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргУслугиТочекУчета].Выгрузить());
	
КонецПроцедуры

#Область Проверка_Результатов_Проведения_ОткрытиеЛицевогоСчета_Базовый

Процедура ПроверитьРезультат_энргАктивностьТочекУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
			
	// Сравниваем с эталоном	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТочкаУчета									|Состояние										|ПериодНачисления				|ПериодРегистрации
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета 	|Перечисления.энргСостояниеТочекУчета.Включена	|ИсходныйОбъект.ПериодНачисления|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[1].ТочкаУчета 	|Перечисления.энргСостояниеТочекУчета.Включена	|ИсходныйОбъект.ПериодНачисления|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета 	|Перечисления.энргСостояниеТочекУчета.Включена	|ИсходныйОбъект.ПериодНачисления|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[3].ТочкаУчета 	|Перечисления.энргСостояниеТочекУчета.Включена	|ИсходныйОбъект.ПериодНачисления|ИсходныйОбъект.Дата";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);
 	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество()); 	
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргВидБлагоустройствАбонента_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|Услуга															|ВидБлагоустройства																		|ПериодНачисления				|ПериодРегистрации
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[0].Услуга 	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[0].ВидБлагоустройстваИндивидуальный|ИсходныйОбъект.ПериодНачисления|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[1].Услуга 	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[1].ВидБлагоустройстваИндивидуальный|ИсходныйОбъект.ПериодНачисления|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[2].Услуга 	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[2].ВидБлагоустройстваИндивидуальный|ИсходныйОбъект.ПериодНачисления|ИсходныйОбъект.Дата";	

	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);
 	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());	
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
		
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ПриборУчета								|Шкала										|ВидДифференцированности								|ПериодРегистрации 	|ПериодНачисления				 	|ТочкаУчета
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[1].ПриборУчета 	|ИсходныйОбъект.ШкалыПриборовУчета[1].Шкала	|Справочники.энргВидыДифференцированности.Однотарифный	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.ТочкиУчета[1].ТочкаУчета
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ПриборУчета 	|ИсходныйОбъект.ШкалыПриборовУчета[2].Шкала	|Справочники.энргВидыДифференцированности.Однотарифный	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета";

	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргВладельцыТочекУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
			
	GherkinТаблица	= 
	"Период				|Организация				|Район					|ТочкаУчета									|АбонентВладелец				|ПериодРегистрации	|ПериодНачисления
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета	|ИсходныйОбъект.КлючПомещения 	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.ТочкиУчета[1].ТочкаУчета	|ИсходныйОбъект.КлючПомещения 	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета	|ИсходныйОбъект.КлючПомещения 	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.ТочкиУчета[3].ТочкаУчета	|ИсходныйОбъект.КлючПомещения 	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления";

	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргВыводПриборовУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";
КонецПроцедуры

Процедура ПроверитьРезультат_энргГруппыПотребителейАбонентов_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	// Проверяем количество
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|Услуга															|ГруппаПотребителей															|ПериодРегистрации	|ПериодНачисления
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[0].Услуга 	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[0].ТарифнаяКатегория	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[1].Услуга 	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[1].ТарифнаяКатегория	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[2].Услуга 	|ИсходныйОбъект.ВидыБлагоустройстваТарифныеКатегории[2].ТарифнаяКатегория	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления";

	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ПриборУчета								|ДатаПоверки													|ПериодРегистрации	|ПериодНачисления					|ТочкаУчета
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[1].ПриборУчета 	|НачалоДня(ИсходныйОбъект.ТочкиУчета[1].ДатаПоверкиСчетчика)	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления 	|ИсходныйОбъект.ТочкиУчета[1].ТочкаУчета
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ПриборУчета 	|НачалоДня(ИсходныйОбъект.ТочкиУчета[2].ДатаПоверкиСчетчика)	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);	
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргДиаметрСеченияТочекУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТочкаУчета									|Использовать 												|ДиаметрСечения								|ПериодРегистрации	|ПериодНачисления					
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета 	|ИсходныйОбъект.ТочкиУчета[0].РассчитыватьПоДиаметруСечения	|ИсходныйОбъект.ТочкиУчета[0].ДиаметрСечения|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[1].ТочкаУчета 	|ИсходныйОбъект.ТочкиУчета[1].РассчитыватьПоДиаметруСечения	|ИсходныйОбъект.ТочкиУчета[1].ДиаметрСечения|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета 	|ИсходныйОбъект.ТочкиУчета[2].РассчитыватьПоДиаметруСечения	|ИсходныйОбъект.ТочкиУчета[2].ДиаметрСечения|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[3].ТочкаУчета 	|ИсходныйОбъект.ТочкиУчета[3].РассчитыватьПоДиаметруСечения	|ИсходныйОбъект.ТочкиУчета[3].ДиаметрСечения|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргЖильцыЛьготныхКатегорий_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗначенияИзмерителейТочекУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
		  	 	
	Ожидаем.Что(Результат.Количество()).Равно(0);
		
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗначенияПлощадей_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
		
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ВидПлощади									|Площадь		|ПериодРегистрации	|ПериодНачисления					
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|Перечисления.энргВидыПлощадей.ОбщаяПлощадь |Число(128.6)	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|Перечисления.энргВидыПлощадей.ЖилаяПлощадь |Число(128.6)	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоличествоЖильцов_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение ""; 
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоличествоКомнат_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|Количество	|ПериодРегистрации	|ПериодНачисления					
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|Число(4)	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоличествоПроживающих_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|Количество	|ПериодРегистрации	|ПериодНачисления					
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|Число(3)	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоличествоПрописанных_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)

	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|Количество	|ПериодРегистрации	|ПериодНачисления					
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|Число(2)	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоличествоСобственников_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|Количество	|ПериодРегистрации	|ПериодНачисления					
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|Число(1)	|ИсходныйОбъект.Дата|ИсходныйОбъект.ПериодНачисления";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоэффциентыПриборовУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ПриборУчета								|Коэффициент|ПериодНачисления					|ПериодРегистрации	|ТочкаУчета					
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[1].ПриборУчета	|Число(1)	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата|ИсходныйОбъект.ТочкиУчета[1].ТочкаУчета
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ПриборУчета	|Число(1)	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета";
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргМаксимальныеПоказания_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргНаправлениеИспользованияТочекУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТочкаУчета								|НаправлениеИспользованияТУ																													|ПериодНачисления					|ПериодРегистрации						
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета|Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(""6c919776-988b-11e9-b7f6-005056bc3fc8""))	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[1].ТочкаУчета|Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(""9734f2d0-c258-11e9-b7f6-005056bc3fc8""))	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета|Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(""6c919776-988b-11e9-b7f6-005056bc3fc8""))	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[3].ТочкаУчета|Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(""6c919776-988b-11e9-b7f6-005056bc3fc8""))	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата";
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);	
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомерПломбПриборовУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ПриборУчета								|НомерПломбы	|ПериодНачисления					|ПериодРегистрации						
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[1].ПриборУчета	|""22222""		|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ПриборУчета	|""1111111""	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата";
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоказанияПриборовУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ПриборУчета								|Шкала																															|ТарифнаяЗона																											|Разделитель|Показание	|СостояниеПоказаний							|КС		|ИсточникПоказаний									|Переворот	|ПериодНачисления					|ПериодРегистрации	|НомерСтрокиТЧ	|ТочкаУчета
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[1].ПриборУчета	|Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(""6c919786-988b-11e9-b7f6-005056bc3fc8""))		|Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор(""96878b7a-82b3-11e9-9919-005056bc3fc8""))	|0			|Число(219)	|Перечисления.энргСостояниеПоказаний.Приняты|Ложь	|Справочники.энргИсточникиПоказаний.ПустаяСсылка()	|Ложь		|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата|2				|ИсходныйОбъект.ТочкиУчета[1].ТочкаУчета
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ПриборУчета	|Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(""6c919786-988b-11e9-b7f6-005056bc3fc8""))		|Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор(""96878b7a-82b3-11e9-9919-005056bc3fc8""))	|0			|Число(924)	|Перечисления.энргСостояниеПоказаний.Приняты|Ложь	|Справочники.энргИсточникиПоказаний.ПустаяСсылка()	|Ложь		|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата|3				|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета";
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоставщикиУслугАбонента_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТочкаУчета								|Услуга																													|ЧастьСоставной	|Поставщик																												|ПериодНачисления					|ПериодРегистрации	
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета|Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(""c52e09c7-9bdb-11e9-b7f6-005056bc3fc8""))		|Ложь			|Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(""be6da574-9bb4-11e9-b7f6-005056bc3fc8""))	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[1].ТочкаУчета|Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(""8d3582b0-c894-11e9-b7f6-005056bc3fc8""))		|Ложь			|Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(""be6da574-9bb4-11e9-b7f6-005056bc3fc8""))	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета|Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(""8d3582b0-c894-11e9-b7f6-005056bc3fc8""))		|Истина			|Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(""be6da574-9bb4-11e9-b7f6-005056bc3fc8""))	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета|Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(""daeb5006-9d60-11e9-b7f6-005056bc3fc8""))		|Истина			|Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(""be6da574-9bb4-11e9-b7f6-005056bc3fc8""))	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[3].ТочкаУчета|Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(""daeb5006-9d60-11e9-b7f6-005056bc3fc8""))		|Ложь			|Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(""be6da574-9bb4-11e9-b7f6-005056bc3fc8""))	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);	
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПриборыТочекУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТочкаУчета								|ПриборУчета								|ПериодНачисления					|ПериодРегистрации	
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[1].ТочкаУчета|ИсходныйОбъект.ТочкиУчета[1].ПриборУчета	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета|ИсходныйОбъект.ТочкиУчета[2].ПриборУчета	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПриборыУзловУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргПриборыУзловУчета_ОткрытиеЛицевогоСчета_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПроживаниеЖильцов_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргПроживаниеЖильцов_ОткрытиеЛицевогоСчета_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеЛС_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|Абонент																											|Состояние	|ПериодНачисления					|ПериодРегистрации	
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор(""65b98e80-a7cb-4813-8d28-28a166d57103""))	|ИСТИНА		|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры 

Процедура ПроверитьРезультат_энргСостояниеПриборовМКД_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргСостояниеЛС_ОткрытиеЛицевогоСчета_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПриборовУзловУчетаАбонента_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргСостояниеПриборовУзловУчетаАбонента_ОткрытиеЛицевогоСчета_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТочкаУчета								|ПриборУчета								|Состояние										|ПериодНачисления					|ПериодРегистрации	
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[1].ТочкаУчета|ИсходныйОбъект.ТочкиУчета[1].ПриборУчета	|Перечисления.энргСостояниеПриборовУчета.Ввод	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета|ИсходныйОбъект.ТочкиУчета[2].ПриборУчета	|Перечисления.энргСостояниеПриборовУчета.Ввод	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ОткрытиеЛицевогоСчета_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСредстваИзмеренияУслуг_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргСредстваИзмеренияУслуг_ОткрытиеЛицевогоСчета_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргТехническаяВозможностьУстановкиПУ_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТочкаУчета								|НетВозможностьУстановкиПУ	|ПериодНачисления					|ПериодРегистрации	
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета|Ложь						|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[1].ТочкаУчета|Ложь						|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета|Ложь						|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[3].ТочкаУчета|Ложь						|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргТипСобственностиАбонентов_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТипСобственности												|НомерДоговораСоцНайма	|ДатаДоговораСоцНайма	|ПериодНачисления					|ПериодРегистрации	
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|Перечисления.энргТипыСобственниковЖилья.ЧастнаяСобственность	|""""					|'0001-01-01 00:00:00'	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);	
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргУслугиТочекУчета_ОткрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|ТочкаУчета								|Услуга																												|ПериодНачисления					|ПериодРегистрации	
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета|Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(""c52e09c7-9bdb-11e9-b7f6-005056bc3fc8""))	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[1].ТочкаУчета|Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(""8d3582b0-c894-11e9-b7f6-005056bc3fc8""))	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[2].ТочкаУчета|Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(""75793644-c96b-11e9-b7f6-005056bc3fc8""))	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[3].ТочкаУчета|Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(""daeb5006-9d60-11e9-b7f6-005056bc3fc8""))	|ИсходныйОбъект.ПериодНачисления	|ИсходныйОбъект.Дата";
	 	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Могу_Провести_ЗакрытиеЛицевогоСчета_Базовый

Процедура Могу_Провести_ЗакрытиеЛицевогоСчета_Базовый() Экспорт
	
	ИнициализацияИнтерактивная();
	
	ОбъектыВПамяти 			= Новый Массив;
	ОбъектыВПамяти.Добавить(СоздатьОбъектВПамяти_ЗакрытиеЛицевогоСчета_Базовый());
	
	ДополнительныеСвойства 	= Новый Структура;
	ТаблицыПодмены 			= Новый Соответствие;
	ТаблицыПодмены.Вставить("Документ.энргОперацияСЛицевымСчетом", ОбъектыВПамяти);
	ДополнительныеСвойства.Вставить("ТаблицыПодмены", ТаблицыПодмены);
	Документы.энргОперацияСЛицевымСчетом.ИнициализироватьДанныеДокумента(ОбъектыВПамяти[0].Ссылка,ДополнительныеСвойства);
	ПроверитьРезультаты_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ДополнительныеСвойства.КлючиТаблицДвижений, ДополнительныеСвойства.ТаблицыДвижений);
	
КонецПроцедуры

Функция СоздатьОбъектВПамяти_ЗакрытиеЛицевогоСчета_Базовый()	
	мЖильцы = Новый Массив;
	мЗначениеПлощадей = Новый Массив;
	мПоказанияПриборовУчета = Новый Массив;
	я_строка_ПоказанияПриборовУчета = Новый Структура;
	я_строка_ПоказанияПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ПоказанияПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("84f1490b-df7f-4e69-9ffe-1c80c543698f"));
	я_строка_ПоказанияПриборовУчета.Вставить("ДатаПоследнихПоказаний",'2019-01-31 12:00:00');
	я_строка_ПоказанияПриборовУчета.Вставить("ЗначениеТарифа",1988.44);
	я_строка_ПоказанияПриборовУчета.Вставить("КоэффициентПУ",1);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныеПоказания",10);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныйОбъемПотребления",1000);
	я_строка_ПоказанияПриборовУчета.Вставить("Переворот",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПереворотИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредыдущиеПоказания",5);
	я_строка_ПоказанияПриборовУчета.Вставить("Разница",1);
	я_строка_ПоказанияПриборовУчета.Вставить("СостояниеПоказаний",Перечисления.энргСостояниеПоказаний.Приняты);
	я_строка_ПоказанияПриборовУчета.Вставить("СреднийОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СтатусИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("Сумма",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ТарифнаяЗона",Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор("d0803476-8916-11e9-a14c-001e679d4599")));
	я_строка_ПоказанияПриборовУчета.Вставить("ТекущиеПоказания",6);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредставлениеЗначениеТарифа","1 988,44");
	я_строка_ПоказанияПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("c4ffb506-d922-11e9-bb31-001e679d459c")));
	мПоказанияПриборовУчета.Добавить(я_строка_ПоказанияПриборовУчета);
	я_строка_ПоказанияПриборовУчета = Новый Структура;
	я_строка_ПоказанияПриборовУчета.Вставить("НомерСтроки",2);
	я_строка_ПоказанияПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("2a7e9e3e-f4e6-48d7-909b-0ac1f200871a"));
	я_строка_ПоказанияПриборовУчета.Вставить("ДатаПоследнихПоказаний",'2019-01-31 12:00:00');
	я_строка_ПоказанияПриборовУчета.Вставить("ЗначениеТарифа",195.81);
	я_строка_ПоказанияПриборовУчета.Вставить("КоэффициентПУ",1);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныеПоказания",10);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныйОбъемПотребления",1000);
	я_строка_ПоказанияПриборовУчета.Вставить("Переворот",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПереворотИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредыдущиеПоказания",2);
	я_строка_ПоказанияПриборовУчета.Вставить("Разница",10);
	я_строка_ПоказанияПриборовУчета.Вставить("СостояниеПоказаний",Перечисления.энргСостояниеПоказаний.Приняты);
	я_строка_ПоказанияПриборовУчета.Вставить("СреднийОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СтатусИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("Сумма",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ТарифнаяЗона",Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор("d0803476-8916-11e9-a14c-001e679d4599")));
	я_строка_ПоказанияПриборовУчета.Вставить("ТекущиеПоказания",12);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредставлениеЗначениеТарифа","195,81");
	я_строка_ПоказанияПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("c4ffb506-d922-11e9-bb31-001e679d459c")));
	мПоказанияПриборовУчета.Добавить(я_строка_ПоказанияПриборовУчета);
	мПоставщикиСоставныхУслуг = Новый Массив;
	мПрочиеУслуги = Новый Массив;
	мТочкиУчета = Новый Массив;
	я_строка_ТочкиУчета = Новый Структура;
	я_строка_ТочкиУчета.Вставить("НомерСтроки",1);
	я_строка_ТочкиУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("6ff54dc5-75d2-4955-b4f6-a5789128b457"));
	я_строка_ТочкиУчета.Вставить("IDСтрокиРодитель",Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	я_строка_ТочкиУчета.Вставить("ДатаПоверкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаПриемки",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиПломбы",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДиаметрСечения",0);
	я_строка_ТочкиУчета.Вставить("КоэффициентПУ",0);
	я_строка_ТочкиУчета.Вставить("НаправлениеИспользованияТУ",Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("НетВозможностьУстановкиПУ",Ложь);
	я_строка_ТочкиУчета.Вставить("НомерПломбы","");
	я_строка_ТочкиУчета.Вставить("ОписаниеПрибора","");
	я_строка_ТочкиУчета.Вставить("ОписаниеТочки","");
	я_строка_ТочкиУчета.Вставить("Поставщик",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("ПриборУчета",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("c31bdcf2-6bbf-4a2e-a48d-5e01f7efbc8f")));
	я_строка_ТочкиУчета.Вставить("РассчитыватьПоДиаметруСечения",Ложь);
	я_строка_ТочкиУчета.Вставить("СтруктураСети",Справочники.бестСтруктураСети.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Техническая",Ложь);
	я_строка_ТочкиУчета.Вставить("ТочкаУчета",Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("8284e232-d9a4-4729-91d2-936d3873eb2c")));
	я_строка_ТочкиУчета.Вставить("УдалитьВидКанальности",Справочники.энргВидыКанальности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьГоловная",Ложь);
	я_строка_ТочкиУчета.Вставить("УдалитьДатаПоследнихПоказаний",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("УдалитьЗаводскойНомер","");
	я_строка_ТочкиУчета.Вставить("УдалитьНаименованиеТочки","");
	я_строка_ТочкиУчета.Вставить("УдалитьРасположение",Справочники.энргМестаРасположенияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьТипПрибораУчета",Справочники.энргТипыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("b4e5de07-88fb-11e9-a14c-001e679d4599")));
	я_строка_ТочкиУчета.Вставить("Энергоназначение",Перечисления.энргВидыЭнергоназначений.ПустаяСсылка());
	я_строка_ТочкиУчета.Вставить("ЭтоСоставнаяУслуга",Ложь);
	я_строка_ТочкиУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("c4ffb506-d922-11e9-bb31-001e679d459c")));
	мТочкиУчета.Добавить(я_строка_ТочкиУчета);
	я_строка_ТочкиУчета = Новый Структура;
	я_строка_ТочкиУчета.Вставить("НомерСтроки",2);
	я_строка_ТочкиУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("eef6c579-29ae-4fbe-9975-95590b4514ae"));
	я_строка_ТочкиУчета.Вставить("IDСтрокиРодитель",Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	я_строка_ТочкиУчета.Вставить("ДатаПоверкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаПриемки",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиПломбы",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДиаметрСечения",0);
	я_строка_ТочкиУчета.Вставить("КоэффициентПУ",0);
	я_строка_ТочкиУчета.Вставить("НаправлениеИспользованияТУ",Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("НетВозможностьУстановкиПУ",Ложь);
	я_строка_ТочкиУчета.Вставить("НомерПломбы","");
	я_строка_ТочкиУчета.Вставить("ОписаниеПрибора","");
	я_строка_ТочкиУчета.Вставить("ОписаниеТочки","");
	я_строка_ТочкиУчета.Вставить("Поставщик",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("ПриборУчета",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("acbe0eab-3bfb-4532-8881-0237458be6d4")));
	я_строка_ТочкиУчета.Вставить("РассчитыватьПоДиаметруСечения",Ложь);
	я_строка_ТочкиУчета.Вставить("СтруктураСети",Справочники.бестСтруктураСети.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Техническая",Ложь);
	я_строка_ТочкиУчета.Вставить("ТочкаУчета",Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("f7169447-13e7-4343-b278-28a35c5877aa")));
	я_строка_ТочкиУчета.Вставить("УдалитьВидКанальности",Справочники.энргВидыКанальности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьГоловная",Ложь);
	я_строка_ТочкиУчета.Вставить("УдалитьДатаПоследнихПоказаний",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("УдалитьЗаводскойНомер","");
	я_строка_ТочкиУчета.Вставить("УдалитьНаименованиеТочки","");
	я_строка_ТочкиУчета.Вставить("УдалитьРасположение",Справочники.энргМестаРасположенияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьТипПрибораУчета",Справочники.энргТипыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("f4466cdc-88f6-11e9-a14c-001e679d4599")));
	я_строка_ТочкиУчета.Вставить("Энергоназначение",Перечисления.энргВидыЭнергоназначений.ПустаяСсылка());
	я_строка_ТочкиУчета.Вставить("ЭтоСоставнаяУслуга",Ложь);
	я_строка_ТочкиУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("c4ffb506-d922-11e9-bb31-001e679d459c")));
	мТочкиУчета.Добавить(я_строка_ТочкиУчета);
	мВидыБлагоустройств = Новый Массив;
	мШкалыПриборовУчета = Новый Массив;
	я_строка_ШкалыПриборовУчета = Новый Структура;
	я_строка_ШкалыПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ШкалыПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("84f1490b-df7f-4e69-9ffe-1c80c543698f"));
	я_строка_ШкалыПриборовУчета.Вставить("IDСтрокиТочкиУчета",Новый УникальныйИдентификатор("6ff54dc5-75d2-4955-b4f6-a5789128b457"));
	я_строка_ШкалыПриборовУчета.Вставить("ВидДифференцированности",Справочники.энргВидыДифференцированности.ПолучитьСсылку(Новый УникальныйИдентификатор("7fb42607-8b3f-11e9-b54e-001e679d4599")));
	я_строка_ШкалыПриборовУчета.Вставить("Шкала",Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("d5f7c897-8a94-11e9-a14c-001e679d4599")));
	я_строка_ШкалыПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("c4ffb506-d922-11e9-bb31-001e679d459c")));
	мШкалыПриборовУчета.Добавить(я_строка_ШкалыПриборовУчета);
	я_строка_ШкалыПриборовУчета = Новый Структура;
	я_строка_ШкалыПриборовУчета.Вставить("НомерСтроки",2);
	я_строка_ШкалыПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("2a7e9e3e-f4e6-48d7-909b-0ac1f200871a"));
	я_строка_ШкалыПриборовУчета.Вставить("IDСтрокиТочкиУчета",Новый УникальныйИдентификатор("eef6c579-29ae-4fbe-9975-95590b4514ae"));
	я_строка_ШкалыПриборовУчета.Вставить("ВидДифференцированности",Справочники.энргВидыДифференцированности.ПолучитьСсылку(Новый УникальныйИдентификатор("7fb42607-8b3f-11e9-b54e-001e679d4599")));
	я_строка_ШкалыПриборовУчета.Вставить("Шкала",Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("d5f7c897-8a94-11e9-a14c-001e679d4599")));
	я_строка_ШкалыПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("c4ffb506-d922-11e9-bb31-001e679d459c")));
	мШкалыПриборовУчета.Добавить(я_строка_ШкалыПриборовУчета);
	мВидыБлагоустройстваТарифныеКатегории = Новый Массив;
	мЗначенияИзмерителей = Новый Массив;
	
	ОбъектСтруктура  = Новый Структура;
	ОбъектСтруктура.Вставить("Проведен",Истина);
	ОбъектСтруктура.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("c4ffb506-d922-11e9-bb31-001e679d459c")));
	ОбъектСтруктура.Вставить("ПометкаУдаления",Ложь);
	ОбъектСтруктура.Вставить("Дата",'2019-09-17 01:11:37');
	ОбъектСтруктура.Вставить("Номер","00000000049");
	ОбъектСтруктура.Вставить("Абонент",Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор("053e4417-df79-4fa4-913d-bb08e4c47df7")));
	ОбъектСтруктура.Вставить("бестКоличествоСобственников",1);
	ОбъектСтруктура.Вставить("бестПостановление",Перечисления.бестРабочиеПостановления.ПустаяСсылка());
	ОбъектСтруктура.Вставить("бестПричинаЗакрытияЛС",Справочники.энргПричинаЗакрытияЛС.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("бестСпособДоставкиЕПД",Справочники.бестСпособыДоставкиЕПД.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("ВидОперации",Перечисления.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС);
	ОбъектСтруктура.Вставить("ГруппаАбонента",Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор("24c46663-8a8e-11e9-a14c-001e679d4599")));
	ОбъектСтруктура.Вставить("ГруппаПотребителей",Справочники.энргГруппыПотребителей.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("ДатаФактическогоСобытия",'2019-08-01 12:00:00');
	ОбъектСтруктура.Вставить("Домовладение",Ложь);
	ОбъектСтруктура.Вставить("КлючПомещения",Справочники.энргКлючиПомещений.ПолучитьСсылку(Новый УникальныйИдентификатор("38b6bdaf-0324-4157-92cc-5439fda3e5de")));
	ОбъектСтруктура.Вставить("КоличествоКомнат",0);
	ОбъектСтруктура.Вставить("КоличествоПроживающих",0);
	ОбъектСтруктура.Вставить("КоличествоПрописанных",0);
	ОбъектСтруктура.Вставить("Контроллер",Справочники.энргСотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("МаршрутКонтроллера",Справочники.энргМаршрутыКонтроллеров.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("ОписаниеАбонента","");
	ОбъектСтруктура.Вставить("Организация",Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("a666b414-88f1-11e9-a14c-001e679d4599")));
	ОбъектСтруктура.Вставить("Основание",Неопределено);
	ОбъектСтруктура.Вставить("Ответственный",Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("80e2182d-91c0-11e9-84fd-001e679d4599")));
	ОбъектСтруктура.Вставить("ПериодНачисления",'2019-09-01 12:00:00');
	ОбъектСтруктура.Вставить("Примечание","");
	ОбъектСтруктура.Вставить("Район",Справочники.энргЗоныОтвественности.ПолучитьСсылку(Новый УникальныйИдентификатор("07c053cb-88f5-11e9-a14c-001e679d4599")));
	ОбъектСтруктура.Вставить("СтарыйЛС","");
	ОбъектСтруктура.Вставить("ТипПлиты",Перечисления.энргТипыПлит.ПустаяСсылка());
	ОбъектСтруктура.Вставить("ТипСобственностиЖилья",Перечисления.энргТипыСобственниковЖилья.ЧастнаяСобственность);
	ОбъектСтруктура.Вставить("УдалитьАдресОбъекта","");
	ОбъектСтруктура.Вставить("УдалитьАдресОбъектаПредставлениеПолей","");
	ОбъектСтруктура.Вставить("УдалитьВидБлагоустройства",Справочники.энргВидыБлагоустройств.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("УдалитьВидОбъекта",Справочники.энргВидыОбъектовАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("УдалитьЛицевойСчет","                  ");
	ОбъектСтруктура.Вставить("УдалитьМКД",Справочники.энргСтроения.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("УдалитьМуниципальноеОбразование",Справочники.энргМуниципальноеОбразование.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("УдалитьОКТМО","");
	ОбъектСтруктура.Вставить("УдалитьПлощадь",0);
	ОбъектСтруктура.Вставить("УдалитьФизЛицо",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("Договор",Справочники.бестДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("НомерДоговораСоцНайма","");
	ОбъектСтруктура.Вставить("ДатаДоговораСоцНайма",'0001-01-01 00:00:00');
	ОбъектСтруктура.Вставить("АбонентСмена",Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("Жильцы",мЖильцы);
	ОбъектСтруктура.Вставить("ЗначениеПлощадей",мЗначениеПлощадей);
	ОбъектСтруктура.Вставить("ПоказанияПриборовУчета",мПоказанияПриборовУчета);
	ОбъектСтруктура.Вставить("ПоставщикиСоставныхУслуг",мПоставщикиСоставныхУслуг);
	ОбъектСтруктура.Вставить("ПрочиеУслуги",мПрочиеУслуги);
	ОбъектСтруктура.Вставить("ТочкиУчета",мТочкиУчета);
	ОбъектСтруктура.Вставить("ВидыБлагоустройств",мВидыБлагоустройств);
	ОбъектСтруктура.Вставить("ШкалыПриборовУчета",мШкалыПриборовУчета);
	ОбъектСтруктура.Вставить("ВидыБлагоустройстваТарифныеКатегории",мВидыБлагоустройстваТарифныеКатегории);
	ОбъектСтруктура.Вставить("ЗначенияИзмерителей",мЗначенияИзмерителей);
	Возврат ОбъектСтруктура;
КонецФункции

Процедура ПроверитьРезультаты_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, КлючиТаблицДвижений, ТаблицыДвижений)
	
	ПроверитьНаличиеТаблиц(КлючиТаблицДвижений);
	
	ПроверитьРезультат_энргАктивностьТочекУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргАктивностьТочекУчета].Выгрузить());
	ПроверитьРезультат_энргВидБлагоустройствАбонента_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидБлагоустройствАбонента].Выгрузить());
	ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидыДифференцированностиПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргВладельцыТочекУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВладельцыТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргВыводПриборовУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВыводПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргГруппыПотребителейАбонентов_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргГруппыПотребителейАбонентов].Выгрузить());
	ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДатыПоверкиПрибораУчета].Выгрузить());
	ПроверитьРезультат_энргДиаметрСеченияТочекУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДиаметрСеченияТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДифференцированностьСредствИзмерения].Выгрузить());
	//ПроверитьРезультат_энргЖильцыЛьготныхКатегорий_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЖильцыЛьготныхКатегорий].Выгрузить());
	//ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗарегистрированныйОбъемПриборов].Выгрузить());
	ПроверитьРезультат_энргЗначенияИзмерителейТочекУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗначенияИзмерителейТочекУчета].Выгрузить());
	ПроверитьРезультат_энргЗначенияПлощадей_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗначенияПлощадей].Выгрузить());
	//ПроверитьРезультат_энргКоличествоЖильцов_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоличествоЖильцов].Выгрузить());
	ПроверитьРезультат_энргКоличествоКомнат_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоличествоКомнат].Выгрузить());
	ПроверитьРезультат_энргКоличествоПроживающих_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоличествоПроживающих].Выгрузить());
	ПроверитьРезультат_энргКоличествоПрописанных_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоличествоПрописанных].Выгрузить());
	ПроверитьРезультат_энргКоличествоСобственников_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоличествоСобственников].Выгрузить());
	ПроверитьРезультат_энргКоэффциентыПриборовУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоэффциентыПриборовУчета].Выгрузить());
	//ПроверитьРезультат_энргМаксимальныеПоказания_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргМаксимальныеПоказания].Выгрузить());
	ПроверитьРезультат_энргНаправлениеИспользованияТочекУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНаправлениеИспользованияТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомераСтрокСтабильногоПериодаПрочихУслуг].Выгрузить());
	ПроверитьРезультат_энргНомерПломбПриборовУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомерПломбПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоказанияПриборовУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоказанияПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоставщикиУслугАбонента_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоставщикиУслугАбонента].Выгрузить());
	ПроверитьРезультат_энргПриборыТочекУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПриборыТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргПриборыУзловУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПриборыУзловУчета].Выгрузить());
	//ПроверитьРезультат_энргПроживаниеЖильцов_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПроживаниеЖильцов].Выгрузить());
	ПроверитьРезультат_энргСостояниеЛС_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеЛС].Выгрузить());
	//ПроверитьРезультат_энргСостояниеПриборовМКД_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовМКД].Выгрузить());
	//ПроверитьРезультат_энргСостояниеПриборовУзловУчетаАбонента_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовУзловУчетаАбонента].Выгрузить());
	ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовУчетаАбонента].Выгрузить());
	//ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеСредствИзмеренияУслуг].Выгрузить());
	//ПроверитьРезультат_энргСредстваИзмеренияУслуг_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСредстваИзмеренияУслуг].Выгрузить());
	ПроверитьРезультат_энргТехническаяВозможностьУстановкиПУ_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргТехническаяВозможностьУстановкиПУ].Выгрузить());
	ПроверитьРезультат_энргТипСобственностиАбонентов_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргТипСобственностиАбонентов].Выгрузить());
	ПроверитьРезультат_энргУслугиТочекУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргУслугиТочекУчета].Выгрузить());	
	
КонецПроцедуры

#Область Проверка_Результатов_Проведения_ЗакрытиеЛицевогоСчета_Базовый

Процедура ПроверитьРезультат_энргАктивностьТочекУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
		
КонецПроцедуры

Процедура ПроверитьРезультат_энргВидБлагоустройствАбонента_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);	
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
		
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргВладельцыТочекУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
		  	 	
	Ожидаем.Что(Результат.Количество()).Равно(0);	
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргВыводПриборовУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";
КонецПроцедуры

Процедура ПроверитьРезультат_энргГруппыПотребителейАбонентов_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);	
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
		 	 	
	Ожидаем.Что(Результат.Количество()).Равно(0);
		
КонецПроцедуры

Процедура ПроверитьРезультат_энргДиаметрСеченияТочекУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
		 	 	
	Ожидаем.Что(Результат.Количество()).Равно(0);	
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргЖильцыЛьготныхКатегорий_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗначенияИзмерителейТочекУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
		  	 	
	Ожидаем.Что(Результат.Количество()).Равно(0);
		
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗначенияПлощадей_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
			 	
	Ожидаем.Что(Результат.Количество()).Равно(0);
		
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоличествоЖильцов_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение ""; 
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоличествоКомнат_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
		 	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоличествоПроживающих_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
		 	 	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоличествоПрописанных_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	  	 	
	Ожидаем.Что(Результат.Количество()).Равно(0);	
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоличествоСобственников_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
		  	 	
	Ожидаем.Что(Результат.Количество()).Равно(0);
		
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоэффциентыПриборовУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
		  	 	
	Ожидаем.Что(Результат.Количество()).Равно(0); 	
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргМаксимальныеПоказания_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргНаправлениеИспользованияТочекУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	  	 	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомерПломбПриборовУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоказанияПриборовУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период					|Организация				|Район					|КлючПомещения					|ПриборУчета																													|Шкала																															|ТарифнаяЗона																											|Разделитель|Показание	|СостояниеПоказаний							|КС		|ИсточникПоказаний									|Переворот	|ПериодНачисления		|ПериодРегистрации	|НомерСтрокиТЧ	|ТочкаУчета
	|'2019.08.01 00:00:00'	|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор(""c31bdcf2-6bbf-4a2e-a48d-5e01f7efbc8f""))	|Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(""d5f7c897-8a94-11e9-a14c-001e679d4599""))		|Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор(""d0803476-8916-11e9-a14c-001e679d4599""))	|0			|Число(6)	|Перечисления.энргСостояниеПоказаний.Приняты|Ложь	|Справочники.энргИсточникиПоказаний.ПустаяСсылка()	|Ложь		|'2019.09.01 00:00:00'	|ИсходныйОбъект.Дата|1				|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета
	|'2019.08.01 00:00:00'	|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор(""acbe0eab-3bfb-4532-8881-0237458be6d4""))	|Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(""d5f7c897-8a94-11e9-a14c-001e679d4599""))		|Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор(""d0803476-8916-11e9-a14c-001e679d4599""))	|0			|Число(12)	|Перечисления.энргСостояниеПоказаний.Приняты|Ложь	|Справочники.энргИсточникиПоказаний.ПустаяСсылка()	|Ложь		|'2019.09.01 00:00:00'	|ИсходныйОбъект.Дата|2				|ИсходныйОбъект.ТочкиУчета[1].ТочкаУчета";
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоставщикиУслугАбонента_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);	
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПриборыТочекУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПриборыУзловУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргПриборыУзловУчета_ЗакрытиеЛицевогоСчета_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПроживаниеЖильцов_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргПроживаниеЖильцов_ЗакрытиеЛицевогоСчета_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеЛС_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период					|Организация				|Район					|Абонент																											|Состояние	|ПериодНачисления		|ПериодРегистрации	
	|'2019.08.01 00:00:00'	|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор(""053e4417-df79-4fa4-913d-bb08e4c47df7""))	|Ложь		|'2019.09.01 00:00:00'	|ИсходныйОбъект.Дата";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры 

Процедура ПроверитьРезультат_энргСостояниеПриборовМКД_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргСостояниеЛС_ЗакрытиеЛицевогоСчета_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПриборовУзловУчетаАбонента_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргСостояниеПриборовУзловУчетаАбонента_ЗакрытиеЛицевогоСчета_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ЗакрытиеЛицевогоСчета_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСредстваИзмеренияУслуг_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргСредстваИзмеренияУслуг_ЗакрытиеЛицевогоСчета_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргТехническаяВозможностьУстановкиПУ_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргТипСобственностиАбонентов_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);	
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргУслугиТочекУчета_ЗакрытиеЛицевогоСчета_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Могу_Провести_СменуСобственника_Базовый

Процедура Могу_Провести_СменаСобственника_Базовый() Экспорт
	
	ИнициализацияИнтерактивная();
		
	ОбъектыВПамяти 			= Новый Массив;
	ОбъектыВПамяти.Добавить(СоздатьОбъектВПамяти_СменаСобственника_Базовый());
	
	ДополнительныеСвойства 	= Новый Структура;
	ТаблицыПодмены 			= Новый Соответствие;
	ТаблицыПодмены.Вставить("Документ.энргОперацияСЛицевымСчетом", ОбъектыВПамяти);
	ДополнительныеСвойства.Вставить("ТаблицыПодмены", ТаблицыПодмены);
	Документы.энргОперацияСЛицевымСчетом.ИнициализироватьДанныеДокумента(ОбъектыВПамяти[0].Ссылка,ДополнительныеСвойства);
	ПроверитьРезультаты_СменаСобственника_Базовый(ОбъектыВПамяти, ДополнительныеСвойства.КлючиТаблицДвижений, ДополнительныеСвойства.ТаблицыДвижений);
	
КонецПроцедуры

Функция СоздатьОбъектВПамяти_СменаСобственника_Базовый() 	
	ОбъектСтруктура  = Новый Структура;
	#Область Жильцы
	мЖильцы = Новый Массив;
	я_строка_Жильцы = Новый Структура;
	я_строка_Жильцы.Вставить("НомерСтроки",1);
	я_строка_Жильцы.Вставить("ФизическоеЛицо",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("750f692c-ef3e-11e9-b517-005056bc3fc8")));
	я_строка_Жильцы.Вставить("ДоляСобственности",0);
	я_строка_Жильцы.Вставить("СвидетельствоОРегистрацииНомер","");
	я_строка_Жильцы.Вставить("СвидетельствоОРегистрацииДата",'0001-01-01 00:00:00');
	я_строка_Жильцы.Вставить("СвидетельствоОРегистрацииСерия","");
	я_строка_Жильцы.Вставить("ДоляСобственностиЧислитель",1);
	я_строка_Жильцы.Вставить("ДоляСобственностиЗнаменатель",1);
	я_строка_Жильцы.Вставить("СвидетельствоОРегистрацииКемВыдан","");
	я_строка_Жильцы.Вставить("ЛьготнаяКатегория",Справочники.энргЛьготныеКатегории.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_Жильцы.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("5e8ee57e-3834-11ea-9604-00155d016301")));
	мЖильцы.Добавить(я_строка_Жильцы);
	#КонецОбласти
	#Область ЗначениеПлощадей
	мЗначениеПлощадей = Новый Массив;
	#КонецОбласти
	#Область ПоказанияПриборовУчета
	мПоказанияПриборовУчета = Новый Массив;
	я_строка_ПоказанияПриборовУчета = Новый Структура;
	я_строка_ПоказанияПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ПоказанияПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("14cde8c4-2c4c-400d-a5d3-b302675eabce"));
	я_строка_ПоказанияПриборовУчета.Вставить("ДатаПоследнихПоказаний",'2019-09-30 12:00:00');
	я_строка_ПоказанияПриборовУчета.Вставить("ЗначениеТарифа",17.42);
	я_строка_ПоказанияПриборовУчета.Вставить("КоэффициентПУ",1);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныеПоказания",1000000);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныйОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Переворот",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПереворотИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредыдущиеПоказания",168);
	я_строка_ПоказанияПриборовУчета.Вставить("Разница",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СостояниеПоказаний",Перечисления.энргСостояниеПоказаний.Отклонены);
	я_строка_ПоказанияПриборовУчета.Вставить("СреднийОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СтатусИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("Сумма",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ТарифнаяЗона",Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор("96878b7a-82b3-11e9-9919-005056bc3fc8")));
	я_строка_ПоказанияПриборовУчета.Вставить("ТекущиеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредставлениеЗначениеТарифа","17,42");
	я_строка_ПоказанияПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("5e8ee57e-3834-11ea-9604-00155d016301")));
	мПоказанияПриборовУчета.Добавить(я_строка_ПоказанияПриборовУчета);
	#КонецОбласти
	#Область ПоставщикиСоставныхУслуг
	мПоставщикиСоставныхУслуг = Новый Массив;
	#КонецОбласти
	#Область ПрочиеУслуги
	мПрочиеУслуги = Новый Массив;
	#КонецОбласти
	#Область ТочкиУчета
	мТочкиУчета = Новый Массив;
	я_строка_ТочкиУчета = Новый Структура;
	я_строка_ТочкиУчета.Вставить("НомерСтроки",1);
	я_строка_ТочкиУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("55fc82a5-d173-48a2-a0aa-078d229a96d0"));
	я_строка_ТочкиУчета.Вставить("IDСтрокиРодитель",Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	я_строка_ТочкиУчета.Вставить("ДатаПоверкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаПриемки",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиПломбы",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДиаметрСечения",0);
	я_строка_ТочкиУчета.Вставить("КоэффициентПУ",0);
	я_строка_ТочкиУчета.Вставить("НаправлениеИспользованияТУ",Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("НетВозможностьУстановкиПУ",Ложь);
	я_строка_ТочкиУчета.Вставить("НомерПломбы","");
	я_строка_ТочкиУчета.Вставить("ОписаниеПрибора","");
	я_строка_ТочкиУчета.Вставить("ОписаниеТочки","");
	я_строка_ТочкиУчета.Вставить("Поставщик",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("ПриборУчета",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("345ea49a-1606-4038-a42c-82142c7dcb4e")));
	я_строка_ТочкиУчета.Вставить("РассчитыватьПоДиаметруСечения",Ложь);
	я_строка_ТочкиУчета.Вставить("СтруктураСети",Справочники.бестСтруктураСети.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Техническая",Ложь);
	я_строка_ТочкиУчета.Вставить("ТочкаУчета",Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("66dba0f3-5225-4034-80be-5ab65b7537f7")));
	я_строка_ТочкиУчета.Вставить("УдалитьВидКанальности",Справочники.энргВидыКанальности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьГоловная",Ложь);
	я_строка_ТочкиУчета.Вставить("УдалитьДатаПоследнихПоказаний",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("УдалитьЗаводскойНомер","");
	я_строка_ТочкиУчета.Вставить("УдалитьНаименованиеТочки","");
	я_строка_ТочкиУчета.Вставить("УдалитьРасположение",Справочники.энргМестаРасположенияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("УдалитьТипПрибораУчета",Справочники.энргТипыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("8d3582b0-c894-11e9-b7f6-005056bc3fc8")));
	я_строка_ТочкиУчета.Вставить("Энергоназначение",Перечисления.энргВидыЭнергоназначений.ПустаяСсылка());
	я_строка_ТочкиУчета.Вставить("ЭтоСоставнаяУслуга",Ложь);
	я_строка_ТочкиУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("5e8ee57e-3834-11ea-9604-00155d016301")));
	мТочкиУчета.Добавить(я_строка_ТочкиУчета);
	#КонецОбласти
	#Область ВидыБлагоустройств
	мВидыБлагоустройств = Новый Массив;
	#КонецОбласти
	#Область ШкалыПриборовУчета
	мШкалыПриборовУчета = Новый Массив;
	я_строка_ШкалыПриборовУчета = Новый Структура;
	я_строка_ШкалыПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ШкалыПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("14cde8c4-2c4c-400d-a5d3-b302675eabce"));
	я_строка_ШкалыПриборовУчета.Вставить("IDСтрокиТочкиУчета",Новый УникальныйИдентификатор("55fc82a5-d173-48a2-a0aa-078d229a96d0"));
	я_строка_ШкалыПриборовУчета.Вставить("ВидДифференцированности",Справочники.энргВидыДифференцированности.ПолучитьСсылку(Новый УникальныйИдентификатор("96878b80-82b3-11e9-9919-005056bc3fc8")));
	я_строка_ШкалыПриборовУчета.Вставить("Шкала",Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("6c919786-988b-11e9-b7f6-005056bc3fc8")));
	я_строка_ШкалыПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("5e8ee57e-3834-11ea-9604-00155d016301")));
	мШкалыПриборовУчета.Добавить(я_строка_ШкалыПриборовУчета);
	#КонецОбласти
	#Область ВидыБлагоустройстваТарифныеКатегории
	мВидыБлагоустройстваТарифныеКатегории = Новый Массив;
	#КонецОбласти
	#Область ЗначенияИзмерителей
	мЗначенияИзмерителей = Новый Массив;
	#КонецОбласти
	#Область ЗаполнениеОбъекта
	ОбъектСтруктура  = Новый Структура;
	ОбъектСтруктура.Вставить("Проведен",Истина);
	ОбъектСтруктура.Вставить("Ссылка",Документы.энргОперацияСЛицевымСчетом.ПолучитьСсылку(Новый УникальныйИдентификатор("5e8ee57e-3834-11ea-9604-00155d016301")));
	ОбъектСтруктура.Вставить("ПометкаУдаления",Ложь);
	ОбъектСтруктура.Вставить("Дата",'2020-01-16 11:45:32');
	ОбъектСтруктура.Вставить("Номер","00000000001");
	ОбъектСтруктура.Вставить("Абонент",Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор("f732782f-bfb6-487b-ae64-754f7bedcf28")));
	ОбъектСтруктура.Вставить("АбонентСмена",Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор("1e7c338c-1334-4821-aa95-1551e374d038")));
	ОбъектСтруктура.Вставить("бестПостановление",Перечисления.бестРабочиеПостановления.ПустаяСсылка());
	ОбъектСтруктура.Вставить("бестПричинаЗакрытияЛС",Справочники.энргПричинаЗакрытияЛС.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("бестСпособДоставкиЕПД",Справочники.бестСпособыДоставкиЕПД.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("ВидОперации",Перечисления.энргВидыОпераций.энргОперацияСЛС_СменаСобственника);
	ОбъектСтруктура.Вставить("ГруппаАбонента",Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор("009dd98a-9972-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("ГруппаПотребителей",Справочники.энргГруппыПотребителей.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("ДатаДоговораСоцНайма",'0001-01-01 00:00:00');
	ОбъектСтруктура.Вставить("ДатаФактическогоСобытия",'0001-01-01 00:00:00');
	ОбъектСтруктура.Вставить("Договор",Справочники.бестДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("Домовладение",Ложь);
	ОбъектСтруктура.Вставить("КлючПомещения",Справочники.энргКлючиПомещений.ПолучитьСсылку(Новый УникальныйИдентификатор("306b6310-43b8-4dde-9745-6f4a1a5c5410")));
	ОбъектСтруктура.Вставить("КоличествоКомнат",0);
	ОбъектСтруктура.Вставить("КоличествоПроживающих",0);
	ОбъектСтруктура.Вставить("КоличествоПрописанных",0);
	ОбъектСтруктура.Вставить("КоличествоСобственников",1);
	ОбъектСтруктура.Вставить("Контроллер",Справочники.энргСотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("МаршрутКонтроллера",Справочники.энргМаршрутыКонтроллеров.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("НомерДоговораСоцНайма","");
	ОбъектСтруктура.Вставить("ОписаниеАбонента","{
	|""ФизЛицо"": ""750f692c-ef3e-11e9-b517-005056bc3fc8"",
	|""ОКТМО"": """",
	|""ВидОбъекта"": ""00000000-0000-0000-0000-000000000000"",
	|""МуниципальноеОбразование"": ""00000000-0000-0000-0000-000000000000"",
	|""АдресОбъекта"": ""650004, Кемеровская область - Кузбасс, Кемерово г, Большевистская ул, дом № 58"",
	|""АдресОбъектаЗначение"": """",
	|""Филиал"": ""00000000-0000-0000-0000-000000000000""
	|}");
	ОбъектСтруктура.Вставить("Организация",Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("5528dddc-9887-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("Основание",Неопределено);
	ОбъектСтруктура.Вставить("Ответственный",Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("efe8e81a-836a-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("ПериодНачисления",'2020-01-01 12:00:00');
	ОбъектСтруктура.Вставить("Примечание","");
	ОбъектСтруктура.Вставить("Район",Справочники.энргЗоныОтвественности.ПолучитьСсылку(Новый УникальныйИдентификатор("5e0ce488-996d-11e9-b7f6-005056bc3fc8")));
	ОбъектСтруктура.Вставить("СтарыйЛС","");
	ОбъектСтруктура.Вставить("ТипПлиты",Перечисления.энргТипыПлит.ПустаяСсылка());
	ОбъектСтруктура.Вставить("ТипСобственностиЖилья",Перечисления.энргТипыСобственниковЖилья.ЧастнаяСобственность);
	ОбъектСтруктура.Вставить("УдалитьАдресОбъекта","");
	ОбъектСтруктура.Вставить("УдалитьАдресОбъектаПредставлениеПолей","");
	ОбъектСтруктура.Вставить("УдалитьВидБлагоустройства",Справочники.энргВидыБлагоустройств.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("УдалитьВидОбъекта",Справочники.энргВидыОбъектовАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("УдалитьЛицевойСчет","                  ");
	ОбъектСтруктура.Вставить("УдалитьМКД",Справочники.энргСтроения.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("УдалитьМуниципальноеОбразование",Справочники.энргМуниципальноеОбразование.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("УдалитьОКТМО","");
	ОбъектСтруктура.Вставить("УдалитьПлощадь",0);
	ОбъектСтруктура.Вставить("УдалитьФизЛицо",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("Жильцы",мЖильцы);
	ОбъектСтруктура.Вставить("ЗначениеПлощадей",мЗначениеПлощадей);
	ОбъектСтруктура.Вставить("ПоказанияПриборовУчета",мПоказанияПриборовУчета);
	ОбъектСтруктура.Вставить("ПоставщикиСоставныхУслуг",мПоставщикиСоставныхУслуг);
	ОбъектСтруктура.Вставить("ПрочиеУслуги",мПрочиеУслуги);
	ОбъектСтруктура.Вставить("ТочкиУчета",мТочкиУчета);
	ОбъектСтруктура.Вставить("ВидыБлагоустройств",мВидыБлагоустройств);
	ОбъектСтруктура.Вставить("ШкалыПриборовУчета",мШкалыПриборовУчета);
	ОбъектСтруктура.Вставить("ВидыБлагоустройстваТарифныеКатегории",мВидыБлагоустройстваТарифныеКатегории);
	ОбъектСтруктура.Вставить("ЗначенияИзмерителей",мЗначенияИзмерителей);
	#КонецОбласти
	Возврат ОбъектСтруктура;
КонецФункции

Процедура ПроверитьРезультаты_СменаСобственника_Базовый(ОбъектыВПамяти, КлючиТаблицДвижений, ТаблицыДвижений)
	
	ПроверитьНаличиеТаблиц(КлючиТаблицДвижений);
	
	ПроверитьРезультат_энргАктивностьТочекУчета_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргАктивностьТочекУчета].Выгрузить());
	ПроверитьРезультат_энргВидБлагоустройствАбонента_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидБлагоустройствАбонента].Выгрузить());
	ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидыДифференцированностиПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргВладельцыТочекУчета_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВладельцыТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргВыводПриборовУчета_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВыводПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргГруппыПотребителейАбонентов_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргГруппыПотребителейАбонентов].Выгрузить());
	ПроверитьРезультат_энргДатыПоверкиПрибораУчета_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДатыПоверкиПрибораУчета].Выгрузить());
	ПроверитьРезультат_энргДиаметрСеченияТочекУчета_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДиаметрСеченияТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргДифференцированностьСредствИзмерения_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДифференцированностьСредствИзмерения].Выгрузить());
	//ПроверитьРезультат_энргЖильцыЛьготныхКатегорий_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЖильцыЛьготныхКатегорий].Выгрузить());
	//ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗарегистрированныйОбъемПриборов].Выгрузить());
	ПроверитьРезультат_энргЗначенияИзмерителейТочекУчета_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗначенияИзмерителейТочекУчета].Выгрузить());
	ПроверитьРезультат_энргЗначенияПлощадей_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗначенияПлощадей].Выгрузить());
	//ПроверитьРезультат_энргКоличествоЖильцов_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоличествоЖильцов].Выгрузить());
	ПроверитьРезультат_энргКоличествоКомнат_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоличествоКомнат].Выгрузить());
	ПроверитьРезультат_энргКоличествоПроживающих_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоличествоПроживающих].Выгрузить());
	ПроверитьРезультат_энргКоличествоПрописанных_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоличествоПрописанных].Выгрузить());
	ПроверитьРезультат_энргКоличествоСобственников_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоличествоСобственников].Выгрузить());
	ПроверитьРезультат_энргКоэффциентыПриборовУчета_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоэффциентыПриборовУчета].Выгрузить());
	//ПроверитьРезультат_энргМаксимальныеПоказания_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргМаксимальныеПоказания].Выгрузить());
	ПроверитьРезультат_энргНаправлениеИспользованияТочекУчета_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНаправлениеИспользованияТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомераСтрокСтабильногоПериодаПрочихУслуг].Выгрузить());
	ПроверитьРезультат_энргНомерПломбПриборовУчета_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомерПломбПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоказанияПриборовУчета_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоказанияПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоставщикиУслугАбонента_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоставщикиУслугАбонента].Выгрузить());
	ПроверитьРезультат_энргПриборыТочекУчета_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПриборыТочекУчета].Выгрузить());
	//ПроверитьРезультат_энргПриборыУзловУчета_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПриборыУзловУчета].Выгрузить());
	//ПроверитьРезультат_энргПроживаниеЖильцов_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПроживаниеЖильцов].Выгрузить());
	ПроверитьРезультат_энргСостояниеЛС_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеЛС].Выгрузить());
	//ПроверитьРезультат_энргСостояниеПриборовМКД_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовМКД].Выгрузить());
	//ПроверитьРезультат_энргСостояниеПриборовУзловУчетаАбонента_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовУзловУчетаАбонента].Выгрузить());
	ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовУчетаАбонента].Выгрузить());
	//ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеСредствИзмеренияУслуг].Выгрузить());
	//ПроверитьРезультат_энргСредстваИзмеренияУслуг_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСредстваИзмеренияУслуг].Выгрузить());
	ПроверитьРезультат_энргТехническаяВозможностьУстановкиПУ_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргТехническаяВозможностьУстановкиПУ].Выгрузить());
	ПроверитьРезультат_энргТипСобственностиАбонентов_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргТипСобственностиАбонентов].Выгрузить());
	ПроверитьРезультат_энргУслугиТочекУчета_СменаСобственника_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргУслугиТочекУчета].Выгрузить());
	
КонецПроцедуры

#Область Проверка_Результатов_Проведения_СменаСобственника_Базовый

Процедура ПроверитьРезультат_энргАктивностьТочекУчета_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргВидБлагоустройствАбонента_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргВладельцыТочекУчета_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргВыводПриборовУчета_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";
КонецПроцедуры

Процедура ПроверитьРезультат_энргГруппыПотребителейАбонентов_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргДатыПоверкиПрибораУчета_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);	
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргДиаметрСеченияТочекУчета_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргДифференцированностьСредствИзмерения_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргЖильцыЛьготныхКатегорий_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗначенияИзмерителейТочекУчета_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗначенияПлощадей_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоличествоЖильцов_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение ""; 
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоличествоКомнат_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоличествоПроживающих_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|Количество	|ПериодРегистрации	|ПериодНачисления					
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|Число(0)	|ИсходныйОбъект.Дата|'2020-01-01 00:00:00'";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоличествоПрописанных_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|Количество	|ПериодРегистрации	|ПериодНачисления					
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|Число(0)	|ИсходныйОбъект.Дата|'2020-01-01 00:00:00'";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоличествоСобственников_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период				|Организация				|Район					|КлючПомещения					|Количество	|ПериодРегистрации	|ПериодНачисления					
	|ИсходныйОбъект.Дата|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|Число(1)	|ИсходныйОбъект.Дата|'2020-01-01 00:00:00'";
	
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоэффциентыПриборовУчета_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргМаксимальныеПоказания_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргНаправлениеИспользованияТочекУчета_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);	
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомерПломбПриборовУчета_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоказанияПриборовУчета_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	GherkinТаблица	= 
	"Период					|Организация				|Район					|КлючПомещения					|ПриборУчета								|Шкала											|ТарифнаяЗона																											|Разделитель|Показание	|СостояниеПоказаний							|КС		|ИсточникПоказаний									|Переворот	|ПериодНачисления		|ПериодРегистрации	|НомерСтрокиТЧ	|ТочкаУчета
	|ИсходныйОбъект.Дата	|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|ИсходныйОбъект.КлючПомещения	|ИсходныйОбъект.ТочкиУчета[0].ПриборУчета	|ИсходныйОбъект.ШкалыПриборовУчета[0].Шкала		|Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор(""96878b7a-82b3-11e9-9919-005056bc3fc8""))	|0			|Число(0)	|Перечисления.энргСостояниеПоказаний.Приняты|Ложь	|Справочники.энргИсточникиПоказаний.ПустаяСсылка()	|Ложь		|'2020-01-01 00:00:00'	|ИсходныйОбъект.Дата|1				|ИсходныйОбъект.ТочкиУчета[0].ТочкаУчета";
		
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоставщикиУслугАбонента_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	Ожидаем.Что(Результат.Количество()).Равно(0);	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПриборыТочекУчета_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПриборыУзловУчета_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргПриборыУзловУчета_СменаСобственника_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргПроживаниеЖильцов_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргПроживаниеЖильцов_СменаСобственника_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеЛС_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	GherkinТаблица	= 
	"Период					|Организация				|Район					|Абонент																											|Состояние	|ПериодНачисления		|ПериодРегистрации	
	|'2020-01-16 11:45:32'	|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор(""f732782f-bfb6-487b-ae64-754f7bedcf28""))	|ИСТИНА		|'2020-01-01 00:00:00'	|ИсходныйОбъект.Дата
	|'2020-01-16 11:45:32'	|ИсходныйОбъект.Организация |ИсходныйОбъект.Район	|Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор(""1e7c338c-1334-4821-aa95-1551e374d038""))	|ЛОЖЬ		|'2020-01-01 00:00:00'	|ИсходныйОбъект.Дата";
	ТаблицаЭталон = ТаблицаПоОписаниюGherkin(GherkinТаблица, ОбъектыВПамяти[0]);  	 	
	Ожидаем.Что(Результат.Количество()).Равно(ТаблицаЭталон.Количество());
	СравнениеТаблиц.ПроверитьРавенствоТаблиц(ТаблицаЭталон,Результат);
	
КонецПроцедуры 

Процедура ПроверитьРезультат_энргСостояниеПриборовМКД_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргСостояниеЛС_СменаСобственника_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПриборовУзловУчетаАбонента_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргСостояниеПриборовУзловУчетаАбонента_СменаСобственника_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_СменаСобственника_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргСредстваИзмеренияУслуг_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "ПроверитьРезультат_энргСредстваИзмеренияУслуг_СменаСобственника_Базовый";	
КонецПроцедуры

Процедура ПроверитьРезультат_энргТехническаяВозможностьУстановкиПУ_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргТипСобственностиАбонентов_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);	
	
КонецПроцедуры

Процедура ПроверитьРезультат_энргУслугиТочекУчета_СменаСобственника_Базовый(ОбъектыВПамяти, Результат)
	
	Ожидаем.Что(Результат.Количество()).Равно(0);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

Функция ТаблицаПоОписаниюGherkin(Знач GherkinТаблица, Знач ИсходныйОбъект)
			
	СтрокиТаблицы						= СтрРазделить(GherkinТаблица,Символы.ПС);
	КолонкиТаблицы 						= СтрРазделить(СтрокиТаблицы[0],"|");
	ТаблицаЭталон 						= Новый ТаблицаЗначений;
	Для Сч = 0 По КолонкиТаблицы.ВГраница() Цикл
		ТаблицаЭталон.Колонки.Добавить(СокрЛП(КолонкиТаблицы[Сч]));
	КонецЦикла;
	
	Для Сч = 1 По СтрокиТаблицы.ВГраница() Цикл
		
		ДанныеСтроки 									= СтрРазделить(СтрокиТаблицы[Сч],"|",Истина);
		Если ДанныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицыЭталон  							= ТаблицаЭталон.Добавить();		
		Для Колонка = 0 По ДанныеСтроки.ВГраница() Цикл
			СтрокаТаблицыЭталон[СокрЛП(КолонкиТаблицы[Колонка])] = Вычислить(СокрЛП(ДанныеСтроки[Колонка]));  
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаЭталон;

КонецФункции

Процедура ПроверитьНаличиеТаблиц(КлючиТаблицДвижений)
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргАктивностьТочекУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргВидБлагоустройствАбонента")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргВидыДифференцированностиПриборовУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргВладельцыТочекУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргВыводПриборовУчета")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргГруппыПотребителейАбонентов")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргДатыПоверкиПрибораУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргДиаметрСеченияТочекУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргДифференцированностьСредствИзмерения")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргЖильцыЛьготныхКатегорий")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргЗарегистрированныйОбъемПриборов")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргЗначенияИзмерителейТочекУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргЗначенияПлощадей")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргКоличествоЖильцов")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргКоличествоКомнат")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргКоличествоПроживающих")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргКоличествоПрописанных")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргКоличествоСобственников")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргКоэффциентыПриборовУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргМаксимальныеПоказания")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргНаправлениеИспользованияТочекУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргНомераСтрокСтабильногоПериодаПрочихУслуг")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргНомерПломбПриборовУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргПоказанияПриборовУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргПоставщикиУслугАбонента")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргПриборыТочекУчета")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргПроживаниеЖильцов")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргПриборыУзловУчета")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСостояниеЛС")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСостояниеПриборовМКД")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСостояниеПриборовУзловУчетаАбонента")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСостояниеПриборовУчетаАбонента")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСостояниеСредствИзмеренияУслуг")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСредстваИзмеренияУслуг")).ЭтоЛожь();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргТехническаяВозможностьУстановкиПУ")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргТипСобственностиАбонентов")).ЭтоИстина();
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргУслугиТочекУчета")).ЭтоИстина();		
КонецПроцедуры
