Перем КонтекстЯдра;
Перем Ожидаем;
Перем СравнениеТаблиц;

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра 		= КонтекстЯдраПараметр;
	Ожидаем 			= КонтекстЯдра.Плагин("УтвержденияBDD");
	СравнениеТаблиц 	= КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц"); 
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	НаборТестов.Добавить("Расчет_Комунальных_Квартир_Базовый");
	НаборТестов.Добавить("Расчет_Комунальных_Квартир_Когда_Есть_Соглашение");
КонецПроцедуры

Процедура Расчет_Комунальных_Квартир_Базовый() Экспорт 

	Делегат  					= Обработки.слжДелегатНачислений.Создать();
	Делегат.МетодИнициализации 	= "РасчетКомунальныхКвартир_Базовый";
	
	ИнструментОбъект  			= энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	ИнструментОбъект.Начислить(Делегат);
	
	//Ожидаем.Что(Делегат.НаборОбъемНачислений().Количество()).Равно(0); 	

КонецПроцедуры

Процедура Расчет_Комунальных_Квартир_Когда_Есть_Соглашение() Экспорт 

	Делегат  					= Обработки.слжДелегатНачислений.Создать();
	Делегат.МетодИнициализации 	= "РасчетКомунальныхКвартир_Когда_Есть_Соглашение";
	
	ИнструментОбъект  			= энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	ИнструментОбъект.Начислить(Делегат);
	
	//Ожидаем.Что(Делегат.НаборОбъемНачислений().Количество()).Равно(0); 	

КонецПроцедуры
