Перем КонтекстЯдра;
Перем Ожидаем;
Перем СравнениеТаблиц;

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра 		= КонтекстЯдраПараметр;
	Ожидаем 			= КонтекстЯдра.Плагин("УтвержденияBDD");
	СравнениеТаблиц 	= КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц"); 
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	НаборТестов.Добавить("Расчет_Комунальных_Квартир_Базовый");
	НаборТестов.Добавить("Расчет_Комунальных_Квартир_Когда_Есть_Соглашение");
КонецПроцедуры

Процедура Расчет_Комунальных_Квартир_Базовый() Экспорт 
	НачатьТранзакцию();
	Делегат  					= Обработки.слжДелегатНачислений.Создать();
	Делегат.МетодИнициализации 	= "РасчетКомунальныхКвартир_Базовый";
	
	ИнструментОбъект  			= энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	ИнструментОбъект.Начислить(Делегат);
	
	НаборОбъемНачислений 		= Делегат.НаборОбъемНачислений;
	НаборОбъемНачислений.Записать();
	
	ОтменитьТранзакцию();
	//Ожидаем.Что(Делегат.НаборОбъемНачислений().Количество()).Равно(0); 	

КонецПроцедуры

Процедура Расчет_Комунальных_Квартир_Когда_Есть_Соглашение() Экспорт 
	НачатьТранзакцию();
	Делегат  					= Обработки.слжДелегатНачислений.Создать();
	Делегат.МетодИнициализации 	= "РасчетКомунальныхКвартир_Когда_Есть_Соглашение";
	
	ИнструментОбъект  			= энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	ИнструментОбъект.Начислить(Делегат);
	
	НаборОбъемНачислений 		= Делегат.НаборОбъемНачислений;
	РегистрыНакопления.энргОбъемНачислений.УдалитьНеЗначащиеЗаписи(НаборОбъемНачислений);
	Для Каждого СтрокаНабора Из НаборОбъемНачислений Цикл
		  РегистрыНакопления.энргОбъемНачислений.РассчитатьСуммы(СтрокаНабора);
	КонецЦикла;
	
	тзНаборОбъемНачислений 		= НаборОбъемНачислений.Выгрузить();
	тзНаборОбъемНачислений.Свернуть("Помещение,ТочкаУчета,Услуга,СпособНачисления","ОбъемУслуги,ОбъемУслугиПотери,ОбъемУслугиПотребленный,ОбъемУслугиПотребленныйПотери,ОбъемУслугиПотребленныйСоцНорма,ОбъемУслугиСоцНорма,Сумма,СуммаПоПовышенномуКоэффициенту");
	      		
	Ожидаем.Что(тзНаборОбъемНачислений.Количество()).Равно(2); 
	Ожидаем.Что(тзНаборОбъемНачислений.Итог("ОбъемУслуги")).Равно(100);
	Ожидаем.Что(тзНаборОбъемНачислений.Итог("ОбъемУслугиПотребленный")).Равно(100);
	Ожидаем.Что(тзНаборОбъемНачислений.Итог("Сумма")).Равно(311);
	
	ОтменитьТранзакцию();
КонецПроцедуры
