Перем КонтекстЯдра;
Перем Ожидаем;
Перем СравнениеТаблиц;
  
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра 		= КонтекстЯдраПараметр;
	Ожидаем 			= КонтекстЯдра.Плагин("УтвержденияBDD");
	СравнениеТаблиц 	= КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц"); 
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	НаборТестов.Добавить("Могу_Провести_ВводПрибораУчета_Базовый");
	НаборТестов.Добавить("Могу_Провести_ЗаменаПрибораУчета_Базовый");
	НаборТестов.Добавить("Могу_Провести_ВыводПрибораУчета_Базовый");
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Процедура ИнициализацияИнтерактивная() 
	
	Если ПустаяСтрока(КаталогПлагинов) Тогда
		КаталогПлагинов 	= "C:\Program Files (x86)\OneScript\lib\add\plugins";
	КонецЕсли;
	
	Если Ожидаем = Неопределено Тогда
		Ожидаем 			= ВнешниеОбработки.Создать(КаталогПлагинов + "\УтвержденияBDD.epf");
	КонецЕсли;
	
	Если СравнениеТаблиц = Неопределено Тогда
		СравнениеТаблиц 	= ВнешниеОбработки.Создать(КаталогПлагинов + "\УтвержденияПроверкаТаблиц.epf");
	КонецЕсли;
	
КонецПроцедуры

#Область Тесты

Процедура Могу_Провести_ВводПрибораУчета_Базовый() Экспорт
	ИнициализацияИнтерактивная();
	
	ОбъектыВПамяти 			= Новый Массив;
	ОбъектыВПамяти.Добавить(СоздатьОбъектВПамяти_ВводПрибораУчета_Базовый());
	
	ДополнительныеСвойства 	= Новый Структура;
	ТаблицыПодмены 			= Новый Соответствие;
	ТаблицыПодмены.Вставить("Документ.энргОперацияСПриборомУчета", ОбъектыВПамяти);
	ДополнительныеСвойства.Вставить("ТаблицыПодмены", ТаблицыПодмены);
	Документы.энргОперацияСПриборомУчета.ИнициализироватьДанныеДокумента(ОбъектыВПамяти[0].Ссылка,ДополнительныеСвойства);
	ПроверитьРезультаты_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ДополнительныеСвойства.КлючиТаблицДвижений, ДополнительныеСвойства.ТаблицыДвижений);
	
КонецПроцедуры

Процедура Могу_Провести_ЗаменаПрибораУчета_Базовый() Экспорт
	ИнициализацияИнтерактивная();
	
	ОбъектыВПамяти 			= Новый Массив;
	ОбъектыВПамяти.Добавить(СоздатьОбъектВПамяти_ЗаменаПрибораУчета_Базовый());
	
	ДополнительныеСвойства 	= Новый Структура;
	ТаблицыПодмены 			= Новый Соответствие;
	ТаблицыПодмены.Вставить("Документ.энргОперацияСПриборомУчета", ОбъектыВПамяти);
	ДополнительныеСвойства.Вставить("ТаблицыПодмены", ТаблицыПодмены);
	Документы.энргОперацияСПриборомУчета.ИнициализироватьДанныеДокумента(ОбъектыВПамяти[0].Ссылка,ДополнительныеСвойства);
	ПроверитьРезультаты_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ДополнительныеСвойства.КлючиТаблицДвижений, ДополнительныеСвойства.ТаблицыДвижений);	
КонецПроцедуры

Процедура Могу_Провести_ВыводПрибораУчета_Базовый() Экспорт
	ИнициализацияИнтерактивная();
	
	ОбъектыВПамяти 			= Новый Массив;
	ОбъектыВПамяти.Добавить(СоздатьОбъектВПамяти_ВыводПрибораУчета_Базовый());
	
	ДополнительныеСвойства 	= Новый Структура;
	ТаблицыПодмены 			= Новый Соответствие;
	ТаблицыПодмены.Вставить("Документ.энргОперацияСПриборомУчета", ОбъектыВПамяти);
	ДополнительныеСвойства.Вставить("ТаблицыПодмены", ТаблицыПодмены);
	Документы.энргОперацияСПриборомУчета.ИнициализироватьДанныеДокумента(ОбъектыВПамяти[0].Ссылка,ДополнительныеСвойства);
	ПроверитьРезультаты_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ДополнительныеСвойства.КлючиТаблицДвижений, ДополнительныеСвойства.ТаблицыДвижений);	
КонецПроцедуры

#КонецОбласти

#Область Могу_Провести_ВводПрибораУчета_Базовый

Функция  СоздатьОбъектВПамяти_ВводПрибораУчета_Базовый()
	#Область ПоказанияПриборовУчета
	мПоказанияПриборовУчета = Новый Массив;
	я_строка_ПоказанияПриборовУчета = Новый Структура;
	я_строка_ПоказанияПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ПоказанияПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("b47568b4-00f2-473b-bd60-3321e4cf6214"));
	я_строка_ПоказанияПриборовУчета.Вставить("ТарифнаяЗона",Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор("8f365e6b-f478-11e8-a9ca-902b34cfd89e")));
	я_строка_ПоказанияПриборовУчета.Вставить("ТекущиеПоказания",128);
	я_строка_ПоказанияПриборовУчета.Вставить("Переворот",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ДатаПоследнихПоказаний",'0001-01-01 00:00:00');
	я_строка_ПоказанияПриборовУчета.Вставить("СреднийОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Разница",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ПереворотИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("СтатусИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныйОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ЗначениеТарифа",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Сумма",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СостояниеПоказаний",Перечисления.энргСостояниеПоказаний.ПустаяСсылка());
	я_строка_ПоказанияПриборовУчета.Вставить("КоэффициентПУ",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредыдущиеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ВыводПрибораУчета",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредставлениеЗначениеТарифа","");
	я_строка_ПоказанияПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСПриборомУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("cb5638c2-2ad9-11ea-a8a3-005056824d75")));
	мПоказанияПриборовУчета.Добавить(я_строка_ПоказанияПриборовУчета);
	#КонецОбласти
	#Область ШкалыПриборовУчета
	мШкалыПриборовУчета = Новый Массив;
	я_строка_ШкалыПриборовУчета = Новый Структура;
	я_строка_ШкалыПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ШкалыПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("b47568b4-00f2-473b-bd60-3321e4cf6214"));
	я_строка_ШкалыПриборовУчета.Вставить("IDСтрокиТочкиУчета",Новый УникальныйИдентификатор("139e0cc1-6abb-4dbd-a23e-c1b8fa1d8c0f"));
	я_строка_ШкалыПриборовУчета.Вставить("ВидДифференцированности",Справочники.энргВидыДифференцированности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ШкалыПриборовУчета.Вставить("Шкала",Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("ae23461a-1fd0-11e9-80d4-00505693999d")));
	я_строка_ШкалыПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСПриборомУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("cb5638c2-2ad9-11ea-a8a3-005056824d75")));
	мШкалыПриборовУчета.Добавить(я_строка_ШкалыПриборовУчета);
	#КонецОбласти
	#Область ТочкиУчета
	мТочкиУчета = Новый Массив;
	я_строка_ТочкиУчета = Новый Структура;
	я_строка_ТочкиУчета.Вставить("НомерСтроки",1);
	я_строка_ТочкиУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("139e0cc1-6abb-4dbd-a23e-c1b8fa1d8c0f"));
	я_строка_ТочкиУчета.Вставить("IDСтрокиВывод",Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	я_строка_ТочкиУчета.Вставить("ДатаПоверкиСчетчика",'2021-09-02 12:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаПриемки",'2015-09-02 12:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиПломбы",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("КоэффициентПУ",1);
	я_строка_ТочкиУчета.Вставить("НомерПломбы","");
	я_строка_ТочкиУчета.Вставить("ОписаниеПрибора","{
	|""ЗаводскойНомер"": ""868167-15"",
	|""РегистрируетОбъем"": ""Нет"",
	|""ТипПрибораУчета"": ""6e52d8f7-9bd8-11e9-80da-95242b1226e0"",
	|""ВидКанальности"": ""4d86fad3-1fb5-11e9-b235-001e679d4599""
	|}");
	я_строка_ТочкиУчета.Вставить("ОписаниеТочки","");
	я_строка_ТочкиУчета.Вставить("ПриборУчета",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("12e85e08-9bda-11e9-80da-95242b1226e0")));
	я_строка_ТочкиУчета.Вставить("ПриборУчетаВывод",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("ТочкаУчета",Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("46121164-a6ea-11e9-80da-95242b1226e0")));
	я_строка_ТочкиУчета.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("0a4d67dc-01c5-11e9-b7b5-001e679d4599")));
	я_строка_ТочкиУчета.Вставить("НаправлениеИспользованияТУ",Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("dedcde85-baa6-11e9-a8e4-005056824d75")));
	я_строка_ТочкиУчета.Вставить("Ссылка",Документы.энргОперацияСПриборомУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("cb5638c2-2ad9-11ea-a8a3-005056824d75")));
	мТочкиУчета.Добавить(я_строка_ТочкиУчета);
	#КонецОбласти
	#Область ЗаполнениеОбъекта
	ОбъектСтруктура  = Новый Структура;
	ОбъектСтруктура.Вставить("Проведен",Истина);
	ОбъектСтруктура.Вставить("Ссылка",Документы.энргОперацияСПриборомУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("cb5638c2-2ad9-11ea-a8a3-005056824d75")));
	ОбъектСтруктура.Вставить("ПометкаУдаления",Ложь);
	ОбъектСтруктура.Вставить("Дата",'2019-12-01 12:00:00');
	ОбъектСтруктура.Вставить("Номер","00000000328");
	ОбъектСтруктура.Вставить("Абонент",Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор("46121163-a6ea-11e9-80da-95242b1226e0")));
	ОбъектСтруктура.Вставить("ВидОперации",Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ);
	ОбъектСтруктура.Вставить("ДатаФактическогоСобытия",'0001-01-01 00:00:00');
	ОбъектСтруктура.Вставить("КлючПомещения",Справочники.энргКлючиПомещений.ПолучитьСсылку(Новый УникальныйИдентификатор("54e3cf08-889a-4ab9-ac9f-f27d9ae218f5")));
	ОбъектСтруктура.Вставить("Контроллер",Справочники.энргСотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("Организация",Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("e6ac4ff0-f477-11e8-a9ca-902b34cfd89e")));
	ОбъектСтруктура.Вставить("Ответственный",Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("fb8bf331-c00d-11e9-a8e4-005056824d75")));
	ОбъектСтруктура.Вставить("ПериодНачисления",'2019-12-01 12:00:00');
	ОбъектСтруктура.Вставить("Примечание","");
	ОбъектСтруктура.Вставить("Район",Справочники.энргЗоныОтвественности.ПолучитьСсылку(Новый УникальныйИдентификатор("4c311883-f3b1-11e8-a68d-001e679d4599")));
	ОбъектСтруктура.Вставить("УдалитьАдресОбъекта","");
	ОбъектСтруктура.Вставить("УдалитьЛицевойСчет","");
	ОбъектСтруктура.Вставить("УдалитьМКД",Справочники.энргСтроения.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("ПоказанияПриборовУчета",мПоказанияПриборовУчета);
	ОбъектСтруктура.Вставить("ШкалыПриборовУчета",мШкалыПриборовУчета);
	ОбъектСтруктура.Вставить("ТочкиУчета",мТочкиУчета);
	#КонецОбласти
	Возврат ОбъектСтруктура;	
КонецФункции

Процедура ПроверитьРезультаты_ВводПрибораУчета_Базовый(ОбъектыВПамяти, КлючиТаблицДвижений, ТаблицыДвижений)
	ПроверитьНаличиеТаблиц(КлючиТаблицДвижений);
	
	ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидыДифференцированностиПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргВыводПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВыводПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДатыПоверкиПрибораУчета].Выгрузить());
	ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДифференцированностьСредствИзмерения].Выгрузить());
	ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗарегистрированныйОбъемПриборов].Выгрузить());
	ПроверитьРезультат_энргКоэффциентыПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоэффциентыПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргМаксимальныеПоказания_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргМаксимальныеПоказания].Выгрузить());
	ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомераСтрокСтабильногоПериодаПрочихУслуг].Выгрузить());
	ПроверитьРезультат_энргНомерПломбПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомерПломбПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоказанияПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоказанияПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПриборыТочекУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПриборыТочекУчета].Выгрузить());
	ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргРасчетныеСпособыТочекУчета].Выгрузить());
	ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовУчетаАбонента].Выгрузить());
	ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеСредствИзмеренияУслуг].Выгрузить());
	ПроверитьРезультат_энргСредстваИзмеренияУслуг_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСредстваИзмеренияУслуг].Выгрузить());
	
КонецПроцедуры

#Область Проверка_Результатов_ВводПрибораУчета_Базовый

Процедура ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргВыводПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоэффциентыПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргМаксимальныеПоказания_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомерПломбПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоказанияПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргПриборыТочекУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСредстваИзмеренияУслуг_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Могу_Провести_ЗаменаПрибораУчета_Базовый

Функция  СоздатьОбъектВПамяти_ЗаменаПрибораУчета_Базовый()
	#Область ПоказанияПриборовУчета
	мПоказанияПриборовУчета = Новый Массив;
	я_строка_ПоказанияПриборовУчета = Новый Структура;
	я_строка_ПоказанияПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ПоказанияПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("46833c45-b223-432e-b428-8d37383b7b14"));
	я_строка_ПоказанияПриборовУчета.Вставить("ТарифнаяЗона",Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор("8f365e6b-f478-11e8-a9ca-902b34cfd89e")));
	я_строка_ПоказанияПриборовУчета.Вставить("ТекущиеПоказания",15);
	я_строка_ПоказанияПриборовУчета.Вставить("Переворот",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ДатаПоследнихПоказаний",'2019-12-01 12:00:00');
	я_строка_ПоказанияПриборовУчета.Вставить("СреднийОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Разница",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ПереворотИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("СтатусИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныеПоказания",10);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныйОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ЗначениеТарифа",29.3);
	я_строка_ПоказанияПриборовУчета.Вставить("Сумма",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СостояниеПоказаний",Перечисления.энргСостояниеПоказаний.Отклонены);
	я_строка_ПоказанияПриборовУчета.Вставить("КоэффициентПУ",1);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредыдущиеПоказания",15);
	я_строка_ПоказанияПриборовУчета.Вставить("ВыводПрибораУчета",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредставлениеЗначениеТарифа","29,3");
	я_строка_ПоказанияПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСПриборомУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("2d5c02f8-27df-11ea-a8a3-005056824d75")));
	мПоказанияПриборовУчета.Добавить(я_строка_ПоказанияПриборовУчета);
	я_строка_ПоказанияПриборовУчета = Новый Структура;
	я_строка_ПоказанияПриборовУчета.Вставить("НомерСтроки",2);
	я_строка_ПоказанияПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("4ab8d347-aeca-4f05-8856-30c1ae950cf0"));
	я_строка_ПоказанияПриборовУчета.Вставить("ТарифнаяЗона",Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор("8f365e6b-f478-11e8-a9ca-902b34cfd89e")));
	я_строка_ПоказанияПриборовУчета.Вставить("ТекущиеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Переворот",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ДатаПоследнихПоказаний",'0001-01-01 00:00:00');
	я_строка_ПоказанияПриборовУчета.Вставить("СреднийОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Разница",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ПереворотИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("СтатусИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныеПоказания",10);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныйОбъемПотребления",1000);
	я_строка_ПоказанияПриборовУчета.Вставить("ЗначениеТарифа",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Сумма",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СостояниеПоказаний",Перечисления.энргСостояниеПоказаний.Отклонены);
	я_строка_ПоказанияПриборовУчета.Вставить("КоэффициентПУ",1);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредыдущиеПоказания",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ВыводПрибораУчета",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредставлениеЗначениеТарифа","");
	я_строка_ПоказанияПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСПриборомУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("2d5c02f8-27df-11ea-a8a3-005056824d75")));
	мПоказанияПриборовУчета.Добавить(я_строка_ПоказанияПриборовУчета);
	#КонецОбласти
	#Область ШкалыПриборовУчета
	мШкалыПриборовУчета = Новый Массив;
	я_строка_ШкалыПриборовУчета = Новый Структура;
	я_строка_ШкалыПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ШкалыПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("46833c45-b223-432e-b428-8d37383b7b14"));
	я_строка_ШкалыПриборовУчета.Вставить("IDСтрокиТочкиУчета",Новый УникальныйИдентификатор("875c30e1-b244-4aca-b872-34d125791f84"));
	я_строка_ШкалыПриборовУчета.Вставить("ВидДифференцированности",Справочники.энргВидыДифференцированности.ПолучитьСсылку(Новый УникальныйИдентификатор("8f365ef4-f478-11e8-a9ca-902b34cfd89e")));
	я_строка_ШкалыПриборовУчета.Вставить("Шкала",Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("ae23461a-1fd0-11e9-80d4-00505693999d")));
	я_строка_ШкалыПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСПриборомУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("2d5c02f8-27df-11ea-a8a3-005056824d75")));
	мШкалыПриборовУчета.Добавить(я_строка_ШкалыПриборовУчета);
	я_строка_ШкалыПриборовУчета = Новый Структура;
	я_строка_ШкалыПриборовУчета.Вставить("НомерСтроки",2);
	я_строка_ШкалыПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("4ab8d347-aeca-4f05-8856-30c1ae950cf0"));
	я_строка_ШкалыПриборовУчета.Вставить("IDСтрокиТочкиУчета",Новый УникальныйИдентификатор("0387f707-53c0-41e4-ae1d-49db0e77c3fa"));
	я_строка_ШкалыПриборовУчета.Вставить("ВидДифференцированности",Справочники.энргВидыДифференцированности.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ШкалыПриборовУчета.Вставить("Шкала",Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("ae23461a-1fd0-11e9-80d4-00505693999d")));
	я_строка_ШкалыПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСПриборомУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("2d5c02f8-27df-11ea-a8a3-005056824d75")));
	мШкалыПриборовУчета.Добавить(я_строка_ШкалыПриборовУчета);
	#КонецОбласти
	#Область ТочкиУчета
	мТочкиУчета = Новый Массив;
	я_строка_ТочкиУчета = Новый Структура;
	я_строка_ТочкиУчета.Вставить("НомерСтроки",1);
	я_строка_ТочкиУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("0387f707-53c0-41e4-ae1d-49db0e77c3fa"));
	я_строка_ТочкиУчета.Вставить("IDСтрокиВывод",Новый УникальныйИдентификатор("875c30e1-b244-4aca-b872-34d125791f84"));
	я_строка_ТочкиУчета.Вставить("ДатаПоверкиСчетчика",'2024-06-04 12:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаПриемки",'2018-06-04 12:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиПломбы",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("КоэффициентПУ",1);
	я_строка_ТочкиУчета.Вставить("НомерПломбы","");
	я_строка_ТочкиУчета.Вставить("ОписаниеПрибора","{
	|""ЗаводскойНомер"": ""170962447"",
	|""РегистрируетОбъем"": ""Нет"",
	|""ТипПрибораУчета"": ""2374f606-18be-11e9-9b04-001e679d4599"",
	|""ВидКанальности"": ""4d86fad3-1fb5-11e9-b235-001e679d4599""
	|}");
	я_строка_ТочкиУчета.Вставить("ОписаниеТочки","");
	я_строка_ТочкиУчета.Вставить("ПриборУчета",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("34d4afe4-821c-4183-b37f-9090a3bfdd4b")));
	я_строка_ТочкиУчета.Вставить("ПриборУчетаВывод",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("b9d90264-5517-412b-a792-349148d62b50")));
	я_строка_ТочкиУчета.Вставить("ТочкаУчета",Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("e77aeb54-b03d-4ac0-a0af-3da3e99bbcf8")));
	я_строка_ТочкиУчета.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("d53829ef-36cf-11e6-80f3-94de80ed4480")));
	я_строка_ТочкиУчета.Вставить("НаправлениеИспользованияТУ",Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Ссылка",Документы.энргОперацияСПриборомУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("2d5c02f8-27df-11ea-a8a3-005056824d75")));
	мТочкиУчета.Добавить(я_строка_ТочкиУчета);
	#КонецОбласти
	#Область ЗаполнениеОбъекта
	ОбъектСтруктура  = Новый Структура;
	ОбъектСтруктура.Вставить("Проведен",Истина);
	ОбъектСтруктура.Вставить("Ссылка",Документы.энргОперацияСПриборомУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("2d5c02f8-27df-11ea-a8a3-005056824d75")));
	ОбъектСтруктура.Вставить("ПометкаУдаления",Ложь);
	ОбъектСтруктура.Вставить("Дата",'2019-12-01 12:00:00');
	ОбъектСтруктура.Вставить("Номер","00000000326");
	ОбъектСтруктура.Вставить("Абонент",Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор("c3e18212-198a-11e9-8caf-001e679d4599")));
	ОбъектСтруктура.Вставить("ВидОперации",Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ);
	ОбъектСтруктура.Вставить("ДатаФактическогоСобытия",'0001-01-01 00:00:00');
	ОбъектСтруктура.Вставить("КлючПомещения",Справочники.энргКлючиПомещений.ПолучитьСсылку(Новый УникальныйИдентификатор("4e84513a-49c9-4ddd-9db9-79bd3c65b4f9")));
	ОбъектСтруктура.Вставить("Контроллер",Справочники.энргСотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор("5881bddc-074e-11e9-aba3-001e679d4599")));
	ОбъектСтруктура.Вставить("Организация",Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("e6ac4ff0-f477-11e8-a9ca-902b34cfd89e")));
	ОбъектСтруктура.Вставить("Ответственный",Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("ebe77408-9cd3-11e9-a8e4-005056824d75")));
	ОбъектСтруктура.Вставить("ПериодНачисления",'2019-12-01 12:00:00');
	ОбъектСтруктура.Вставить("Примечание","");
	ОбъектСтруктура.Вставить("Район",Справочники.энргЗоныОтвественности.ПолучитьСсылку(Новый УникальныйИдентификатор("194880f6-f408-11e8-a68d-001e679d4599")));
	ОбъектСтруктура.Вставить("УдалитьАдресОбъекта","");
	ОбъектСтруктура.Вставить("УдалитьЛицевойСчет","");
	ОбъектСтруктура.Вставить("УдалитьМКД",Справочники.энргСтроения.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("ПоказанияПриборовУчета",мПоказанияПриборовУчета);
	ОбъектСтруктура.Вставить("ШкалыПриборовУчета",мШкалыПриборовУчета);
	ОбъектСтруктура.Вставить("ТочкиУчета",мТочкиУчета);
	#КонецОбласти
	Возврат ОбъектСтруктура;	
КонецФункции

Процедура ПроверитьРезультаты_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, КлючиТаблицДвижений, ТаблицыДвижений)
	
	ПроверитьНаличиеТаблиц(КлючиТаблицДвижений);
	
	ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидыДифференцированностиПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргВыводПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВыводПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДатыПоверкиПрибораУчета].Выгрузить());
	ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДифференцированностьСредствИзмерения].Выгрузить());
	ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗарегистрированныйОбъемПриборов].Выгрузить());
	ПроверитьРезультат_энргКоэффциентыПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоэффциентыПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргМаксимальныеПоказания_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргМаксимальныеПоказания].Выгрузить());
	ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомераСтрокСтабильногоПериодаПрочихУслуг].Выгрузить());
	ПроверитьРезультат_энргНомерПломбПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомерПломбПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоказанияПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоказанияПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПриборыТочекУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПриборыТочекУчета].Выгрузить());
	ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргРасчетныеСпособыТочекУчета].Выгрузить());
	ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовУчетаАбонента].Выгрузить());
	ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеСредствИзмеренияУслуг].Выгрузить());
	ПроверитьРезультат_энргСредстваИзмеренияУслуг_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСредстваИзмеренияУслуг].Выгрузить());
	
КонецПроцедуры

#Область Проверка_Результатов_ЗаменаПрибораУчета_Базовый

Процедура ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргВыводПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоэффциентыПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргМаксимальныеПоказания_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомерПломбПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоказанияПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргПриборыТочекУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСредстваИзмеренияУслуг_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Могу_Провести_ВыводПрибораУчета_Базовый

Функция  СоздатьОбъектВПамяти_ВыводПрибораУчета_Базовый()
	#Область ПоказанияПриборовУчета
	мПоказанияПриборовУчета = Новый Массив;
	я_строка_ПоказанияПриборовУчета = Новый Структура;
	я_строка_ПоказанияПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ПоказанияПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("7d9b690d-a28f-4b48-8ecc-4affed350453"));
	я_строка_ПоказанияПриборовУчета.Вставить("ТарифнаяЗона",Справочники.энргТарифныеЗоны.ПолучитьСсылку(Новый УникальныйИдентификатор("8f365e6b-f478-11e8-a9ca-902b34cfd89e")));
	я_строка_ПоказанияПриборовУчета.Вставить("ТекущиеПоказания",152);
	я_строка_ПоказанияПриборовУчета.Вставить("Переворот",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ДатаПоследнихПоказаний",'2019-11-01 12:00:00');
	я_строка_ПоказанияПриборовУчета.Вставить("СреднийОбъемПотребления",0);
	я_строка_ПоказанияПриборовУчета.Вставить("Разница",0);
	я_строка_ПоказанияПриборовУчета.Вставить("ПереворотИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("СтатусИзмененПользователем",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныеПоказания",10);
	я_строка_ПоказанияПриборовУчета.Вставить("МаксимальноВозможныйОбъемПотребления",1000);
	я_строка_ПоказанияПриборовУчета.Вставить("ЗначениеТарифа",2293.67);
	я_строка_ПоказанияПриборовУчета.Вставить("Сумма",0);
	я_строка_ПоказанияПриборовУчета.Вставить("СостояниеПоказаний",Перечисления.энргСостояниеПоказаний.Приняты);
	я_строка_ПоказанияПриборовУчета.Вставить("КоэффициентПУ",1);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредыдущиеПоказания",152);
	я_строка_ПоказанияПриборовУчета.Вставить("ВыводПрибораУчета",Ложь);
	я_строка_ПоказанияПриборовУчета.Вставить("ПредставлениеЗначениеТарифа","26,99/2 26");
	я_строка_ПоказанияПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСПриборомУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("36f57d7c-2ad9-11ea-a8a3-005056824d75")));
	мПоказанияПриборовУчета.Добавить(я_строка_ПоказанияПриборовУчета);
	#КонецОбласти
	#Область ШкалыПриборовУчета
	мШкалыПриборовУчета = Новый Массив;
	я_строка_ШкалыПриборовУчета = Новый Структура;
	я_строка_ШкалыПриборовУчета.Вставить("НомерСтроки",1);
	я_строка_ШкалыПриборовУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("7d9b690d-a28f-4b48-8ecc-4affed350453"));
	я_строка_ШкалыПриборовУчета.Вставить("IDСтрокиТочкиУчета",Новый УникальныйИдентификатор("32a8d8cf-b9e7-4bea-9260-216d5cb659b2"));
	я_строка_ШкалыПриборовУчета.Вставить("ВидДифференцированности",Справочники.энргВидыДифференцированности.ПолучитьСсылку(Новый УникальныйИдентификатор("8f365ef4-f478-11e8-a9ca-902b34cfd89e")));
	я_строка_ШкалыПриборовУчета.Вставить("Шкала",Справочники.энргШкалыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("ae23461a-1fd0-11e9-80d4-00505693999d")));
	я_строка_ШкалыПриборовУчета.Вставить("Ссылка",Документы.энргОперацияСПриборомУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("36f57d7c-2ad9-11ea-a8a3-005056824d75")));
	мШкалыПриборовУчета.Добавить(я_строка_ШкалыПриборовУчета);
	#КонецОбласти
	#Область ТочкиУчета
	мТочкиУчета = Новый Массив;
	я_строка_ТочкиУчета = Новый Структура;
	я_строка_ТочкиУчета.Вставить("НомерСтроки",1);
	я_строка_ТочкиУчета.Вставить("IDСтроки",Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	я_строка_ТочкиУчета.Вставить("IDСтрокиВывод",Новый УникальныйИдентификатор("32a8d8cf-b9e7-4bea-9260-216d5cb659b2"));
	я_строка_ТочкиУчета.Вставить("ДатаПоверкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаПриемки",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиПломбы",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("ДатаУстановкиСчетчика",'0001-01-01 00:00:00');
	я_строка_ТочкиУчета.Вставить("КоэффициентПУ",0);
	я_строка_ТочкиУчета.Вставить("НомерПломбы","");
	я_строка_ТочкиУчета.Вставить("ОписаниеПрибора","");
	я_строка_ТочкиУчета.Вставить("ОписаниеТочки","");
	я_строка_ТочкиУчета.Вставить("ПриборУчета",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("ПриборУчетаВывод",Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор("12e85e08-9bda-11e9-80da-95242b1226e0")));
	я_строка_ТочкиУчета.Вставить("ТочкаУчета",Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("46121164-a6ea-11e9-80da-95242b1226e0")));
	я_строка_ТочкиУчета.Вставить("Услуга",Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор("0a4d67dc-01c5-11e9-b7b5-001e679d4599")));
	я_строка_ТочкиУчета.Вставить("НаправлениеИспользованияТУ",Справочники.энргНаправлениеИспользованияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	я_строка_ТочкиУчета.Вставить("Ссылка",Документы.энргОперацияСПриборомУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("36f57d7c-2ad9-11ea-a8a3-005056824d75")));
	мТочкиУчета.Добавить(я_строка_ТочкиУчета);
	#КонецОбласти
	#Область ЗаполнениеОбъекта
	ОбъектСтруктура  = Новый Структура;
	ОбъектСтруктура.Вставить("Проведен",Истина);
	ОбъектСтруктура.Вставить("Ссылка",Документы.энргОперацияСПриборомУчета.ПолучитьСсылку(Новый УникальныйИдентификатор("36f57d7c-2ad9-11ea-a8a3-005056824d75")));
	ОбъектСтруктура.Вставить("ПометкаУдаления",Ложь);
	ОбъектСтруктура.Вставить("Дата",'2019-12-01 12:00:00');
	ОбъектСтруктура.Вставить("Номер","00000000327");
	ОбъектСтруктура.Вставить("Абонент",Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор("46121163-a6ea-11e9-80da-95242b1226e0")));
	ОбъектСтруктура.Вставить("ВидОперации",Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ);
	ОбъектСтруктура.Вставить("ДатаФактическогоСобытия",'0001-01-01 00:00:00');
	ОбъектСтруктура.Вставить("КлючПомещения",Справочники.энргКлючиПомещений.ПолучитьСсылку(Новый УникальныйИдентификатор("54e3cf08-889a-4ab9-ac9f-f27d9ae218f5")));
	ОбъектСтруктура.Вставить("Контроллер",Справочники.энргСотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("Организация",Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("e6ac4ff0-f477-11e8-a9ca-902b34cfd89e")));
	ОбъектСтруктура.Вставить("Ответственный",Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("fb8bf331-c00d-11e9-a8e4-005056824d75")));
	ОбъектСтруктура.Вставить("ПериодНачисления",'2019-12-01 12:00:00');
	ОбъектСтруктура.Вставить("Примечание","");
	ОбъектСтруктура.Вставить("Район",Справочники.энргЗоныОтвественности.ПолучитьСсылку(Новый УникальныйИдентификатор("4c311883-f3b1-11e8-a68d-001e679d4599")));
	ОбъектСтруктура.Вставить("УдалитьАдресОбъекта","");
	ОбъектСтруктура.Вставить("УдалитьЛицевойСчет","");
	ОбъектСтруктура.Вставить("УдалитьМКД",Справочники.энргСтроения.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	ОбъектСтруктура.Вставить("ПоказанияПриборовУчета",мПоказанияПриборовУчета);
	ОбъектСтруктура.Вставить("ШкалыПриборовУчета",мШкалыПриборовУчета);
	ОбъектСтруктура.Вставить("ТочкиУчета",мТочкиУчета);
	#КонецОбласти
	Возврат ОбъектСтруктура;	
КонецФункции

Процедура ПроверитьРезультаты_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, КлючиТаблицДвижений, ТаблицыДвижений)
	
	ПроверитьНаличиеТаблиц(КлючиТаблицДвижений);
	
	ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидыДифференцированностиПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргВыводПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВыводПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДатыПоверкиПрибораУчета].Выгрузить());
	ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДифференцированностьСредствИзмерения].Выгрузить());
	ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗарегистрированныйОбъемПриборов].Выгрузить());
	ПроверитьРезультат_энргКоэффциентыПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоэффциентыПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргМаксимальныеПоказания_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргМаксимальныеПоказания].Выгрузить());
	ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомераСтрокСтабильногоПериодаПрочихУслуг].Выгрузить());
	ПроверитьРезультат_энргНомерПломбПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомерПломбПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоказанияПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоказанияПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПриборыТочекУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПриборыТочекУчета].Выгрузить());
	ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргРасчетныеСпособыТочекУчета].Выгрузить());
	ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовУчетаАбонента].Выгрузить());
	ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеСредствИзмеренияУслуг].Выгрузить());
	ПроверитьРезультат_энргСредстваИзмеренияУслуг_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСредстваИзмеренияУслуг].Выгрузить());
	
КонецПроцедуры

#Область Проверка_Результатов_ВыводПрибораУчета_Базовый

Процедура ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргВыводПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоэффциентыПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргМаксимальныеПоказания_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомерПломбПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоказанияПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргПриборыТочекУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСредстваИзмеренияУслуг_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

#КонецОбласти

#КонецОбласти

Процедура ПроверитьНаличиеТаблиц(КлючиТаблицДвижений)
	
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргВидыДифференцированностиПриборовУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргВыводПриборовУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргДатыПоверкиПрибораУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргДифференцированностьСредствИзмерения").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргЗарегистрированныйОбъемПриборов").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргКоэффциентыПриборовУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргМаксимальныеПоказания").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргНомераСтрокСтабильногоПериодаПрочихУслуг").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргНомерПломбПриборовУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргПоказанияПриборовУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргПриборыТочекУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргРасчетныеСпособыТочекУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСостояниеПриборовУчетаАбонента").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСостояниеСредствИзмеренияУслуг").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСредстваИзмеренияУслуг").ЭтоИстина());
	
	Ожидаем.Что(КлючиТаблицДвижений.Количество()).Равно(15);
	
КонецПроцедуры

Функция ТаблицаПоОписаниюGherkin(Знач GherkinТаблица, Знач ИсходныйОбъект)
	
	СтрокиТаблицы						= СтрРазделить(GherkinТаблица,Символы.ПС);
	КолонкиТаблицы 						= СтрРазделить(СтрокиТаблицы[0],"|");
	ТаблицаЭталон 						= Новый ТаблицаЗначений;
	Для Сч = 0 По КолонкиТаблицы.ВГраница() Цикл
		ТаблицаЭталон.Колонки.Добавить(СокрЛП(КолонкиТаблицы[Сч]));
	КонецЦикла;
	
	Для Сч = 1 По СтрокиТаблицы.ВГраница() Цикл
		
		ДанныеСтроки 									= СтрРазделить(СтрокиТаблицы[Сч],"|",Истина);
		Если ДанныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицыЭталон  							= ТаблицаЭталон.Добавить();		
		Для Колонка = 0 По ДанныеСтроки.ВГраница() Цикл
			СтрокаТаблицыЭталон[СокрЛП(КолонкиТаблицы[Колонка])] = Вычислить(СокрЛП(ДанныеСтроки[Колонка]));  
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаЭталон;
	
КонецФункции

//"(ПроверитьРезультат_)(энрг.{1,})(_ПодключениеУслуги_Базовый\(ОбъектыВПамяти\, ТаблицыДвижений\[КлючиТаблицДвижений\.)(энргАктивностьТочекУчета)(\]\.Выгрузить\(\)\);)";
//"$1$2$3$2$5";