Перем КонтекстЯдра;
Перем Ожидаем;
Перем СравнениеТаблиц;

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра 		= КонтекстЯдраПараметр;
	Ожидаем 			= КонтекстЯдра.Плагин("УтвержденияBDD");
	СравнениеТаблиц 	= КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц"); 
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	НаборТестов.Добавить("Могу_Провести_ВводПрибораУчета_Базовый");
	НаборТестов.Добавить("Могу_Провести_ЗаменаПрибораУчета_Базовый");
	НаборТестов.Добавить("Могу_Провести_ВыводПрибораУчета_Базовый");
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Процедура ИнициализацияИнтерактивная() 
	
	Если ПустаяСтрока(КаталогПлагинов) Тогда
		КаталогПлагинов 	= "C:\Program Files (x86)\OneScript\lib\add\plugins";
	КонецЕсли;
	
	Если Ожидаем = Неопределено Тогда
		Ожидаем 			= ВнешниеОбработки.Создать(КаталогПлагинов + "\УтвержденияBDD.epf");
	КонецЕсли;
	
	Если СравнениеТаблиц = Неопределено Тогда
		СравнениеТаблиц 	= ВнешниеОбработки.Создать(КаталогПлагинов + "\УтвержденияПроверкаТаблиц.epf");
	КонецЕсли;
	
КонецПроцедуры

#Область Тесты

Процедура Могу_Провести_ВводПрибораУчета_Базовый() Экспорт
	ИнициализацияИнтерактивная();
	
	ОбъектыВПамяти 			= Новый Массив;
	ОбъектыВПамяти.Добавить(СоздатьОбъектВПамяти_ВводПрибораУчета_Базовый());
	
	ДополнительныеСвойства 	= Новый Структура;
	ТаблицыПодмены 			= Новый Соответствие;
	ТаблицыПодмены.Вставить("Документ.энргОперацияСПриборомУчета", ОбъектыВПамяти);
	ДополнительныеСвойства.Вставить("ТаблицыПодмены", ТаблицыПодмены);
	Документы.энргОперацияСПриборомУчета.ИнициализироватьДанныеДокумента(ОбъектыВПамяти[0].Ссылка,ДополнительныеСвойства);
	ПроверитьРезультаты_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ДополнительныеСвойства.КлючиТаблицДвижений, ДополнительныеСвойства.ТаблицыДвижений);
	
КонецПроцедуры

Процедура Могу_Провести_ЗаменаПрибораУчета_Базовый() Экспорт
	ИнициализацияИнтерактивная();
	
	ОбъектыВПамяти 			= Новый Массив;
	ОбъектыВПамяти.Добавить(СоздатьОбъектВПамяти_ЗаменаПрибораУчета_Базовый());
	
	ДополнительныеСвойства 	= Новый Структура;
	ТаблицыПодмены 			= Новый Соответствие;
	ТаблицыПодмены.Вставить("Документ.энргОперацияСПриборомУчета", ОбъектыВПамяти);
	ДополнительныеСвойства.Вставить("ТаблицыПодмены", ТаблицыПодмены);
	Документы.энргОперацияСПриборомУчета.ИнициализироватьДанныеДокумента(ОбъектыВПамяти[0].Ссылка,ДополнительныеСвойства);
	ПроверитьРезультаты_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ДополнительныеСвойства.КлючиТаблицДвижений, ДополнительныеСвойства.ТаблицыДвижений);	
КонецПроцедуры

Процедура Могу_Провести_ВыводПрибораУчета_Базовый() Экспорт
	ИнициализацияИнтерактивная();
	
	ОбъектыВПамяти 			= Новый Массив;
	ОбъектыВПамяти.Добавить(СоздатьОбъектВПамяти_ВыводПрибораУчета_Базовый());
	
	ДополнительныеСвойства 	= Новый Структура;
	ТаблицыПодмены 			= Новый Соответствие;
	ТаблицыПодмены.Вставить("Документ.энргОперацияСПриборомУчета", ОбъектыВПамяти);
	ДополнительныеСвойства.Вставить("ТаблицыПодмены", ТаблицыПодмены);
	Документы.энргОперацияСПриборомУчета.ИнициализироватьДанныеДокумента(ОбъектыВПамяти[0].Ссылка,ДополнительныеСвойства);
	ПроверитьРезультаты_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ДополнительныеСвойства.КлючиТаблицДвижений, ДополнительныеСвойства.ТаблицыДвижений);	
КонецПроцедуры

#КонецОбласти

#Область Могу_Провести_ВводПрибораУчета_Базовый

Функция  СоздатьОбъектВПамяти_ВводПрибораУчета_Базовый()
	
КонецФункции

Процедура ПроверитьРезультаты_ВводПрибораУчета_Базовый(ОбъектыВПамяти, КлючиТаблицДвижений, ТаблицыДвижений)
	ПроверитьНаличиеТаблиц(КлючиТаблицДвижений);
	
	ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидыДифференцированностиПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргВыводПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВыводПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДатыПоверкиПрибораУчета].Выгрузить());
	ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДифференцированностьСредствИзмерения].Выгрузить());
	ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗарегистрированныйОбъемПриборов].Выгрузить());
	ПроверитьРезультат_энргКоэффциентыПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоэффциентыПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргМаксимальныеПоказания_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргМаксимальныеПоказания].Выгрузить());
	ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомераСтрокСтабильногоПериодаПрочихУслуг].Выгрузить());
	ПроверитьРезультат_энргНомерПломбПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомерПломбПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоказанияПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоказанияПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПриборыТочекУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПриборыТочекУчета].Выгрузить());
	ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргРасчетныеСпособыТочекУчета].Выгрузить());
	ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовУчетаАбонента].Выгрузить());
	ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеСредствИзмеренияУслуг].Выгрузить());
	ПроверитьРезультат_энргСредстваИзмеренияУслуг_ВводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСредстваИзмеренияУслуг].Выгрузить());
	
КонецПроцедуры

#Область Проверка_Результатов_ВводПрибораУчета_Базовый

Процедура ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргВыводПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоэффциентыПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргМаксимальныеПоказания_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомерПломбПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоказанияПриборовУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргПриборыТочекУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСредстваИзмеренияУслуг_ВводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Могу_Провести_ЗаменаПрибораУчета_Базовый

Функция  СоздатьОбъектВПамяти_ЗаменаПрибораУчета_Базовый()
	
КонецФункции

Процедура ПроверитьРезультаты_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, КлючиТаблицДвижений, ТаблицыДвижений)
	
	ПроверитьНаличиеТаблиц(КлючиТаблицДвижений);
	
	ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидыДифференцированностиПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргВыводПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВыводПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДатыПоверкиПрибораУчета].Выгрузить());
	ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДифференцированностьСредствИзмерения].Выгрузить());
	ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗарегистрированныйОбъемПриборов].Выгрузить());
	ПроверитьРезультат_энргКоэффциентыПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоэффциентыПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргМаксимальныеПоказания_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргМаксимальныеПоказания].Выгрузить());
	ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомераСтрокСтабильногоПериодаПрочихУслуг].Выгрузить());
	ПроверитьРезультат_энргНомерПломбПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомерПломбПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоказанияПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоказанияПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПриборыТочекУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПриборыТочекУчета].Выгрузить());
	ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргРасчетныеСпособыТочекУчета].Выгрузить());
	ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовУчетаАбонента].Выгрузить());
	ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеСредствИзмеренияУслуг].Выгрузить());
	ПроверитьРезультат_энргСредстваИзмеренияУслуг_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСредстваИзмеренияУслуг].Выгрузить());
	
КонецПроцедуры

#Область Проверка_Результатов_ЗаменаПрибораУчета_Базовый

Процедура ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргВыводПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоэффциентыПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргМаксимальныеПоказания_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомерПломбПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоказанияПриборовУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргПриборыТочекУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСредстваИзмеренияУслуг_ЗаменаПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Могу_Провести_ВыводПрибораУчета_Базовый

Функция  СоздатьОбъектВПамяти_ВыводПрибораУчета_Базовый()
	
КонецФункции

Процедура ПроверитьРезультаты_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, КлючиТаблицДвижений, ТаблицыДвижений)
	
	ПроверитьНаличиеТаблиц(КлючиТаблицДвижений);
	
	ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВидыДифференцированностиПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргВыводПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргВыводПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДатыПоверкиПрибораУчета].Выгрузить());
	ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргДифференцированностьСредствИзмерения].Выгрузить());
	ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргЗарегистрированныйОбъемПриборов].Выгрузить());
	ПроверитьРезультат_энргКоэффциентыПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргКоэффциентыПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргМаксимальныеПоказания_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргМаксимальныеПоказания].Выгрузить());
	ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомераСтрокСтабильногоПериодаПрочихУслуг].Выгрузить());
	ПроверитьРезультат_энргНомерПломбПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргНомерПломбПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПоказанияПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПоказанияПриборовУчета].Выгрузить());
	ПроверитьРезультат_энргПриборыТочекУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргПриборыТочекУчета].Выгрузить());
	ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргРасчетныеСпособыТочекУчета].Выгрузить());
	ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеПриборовУчетаАбонента].Выгрузить());
	ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСостояниеСредствИзмеренияУслуг].Выгрузить());
	ПроверитьРезультат_энргСредстваИзмеренияУслуг_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, ТаблицыДвижений[КлючиТаблицДвижений.энргСредстваИзмеренияУслуг].Выгрузить());
	
КонецПроцедуры

#Область Проверка_Результатов_ВыводПрибораУчета_Базовый

Процедура ПроверитьРезультат_энргВидыДифференцированностиПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргВыводПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргДатыПоверкиПрибораУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргДифференцированностьСредствИзмерения_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргЗарегистрированныйОбъемПриборов_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргКоэффциентыПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргМаксимальныеПоказания_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомераСтрокСтабильногоПериодаПрочихУслуг_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргНомерПломбПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргПоказанияПриборовУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргПриборыТочекУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргРасчетныеСпособыТочекУчета_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеПриборовУчетаАбонента_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСостояниеСредствИзмеренияУслуг_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

Процедура ПроверитьРезультат_энргСредстваИзмеренияУслуг_ВыводПрибораУчета_Базовый(ОбъектыВПамяти, Результат)
	ВызватьИсключение "Метод не реализован"
КонецПроцедуры

#КонецОбласти

#КонецОбласти

Процедура ПроверитьНаличиеТаблиц(КлючиТаблицДвижений)
	
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргВидыДифференцированностиПриборовУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргВыводПриборовУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргДатыПоверкиПрибораУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргДифференцированностьСредствИзмерения").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргЗарегистрированныйОбъемПриборов").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргКоэффциентыПриборовУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргМаксимальныеПоказания").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргНомераСтрокСтабильногоПериодаПрочихУслуг").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргНомерПломбПриборовУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргПоказанияПриборовУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргПриборыТочекУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргРасчетныеСпособыТочекУчета").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСостояниеПриборовУчетаАбонента").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСостояниеСредствИзмеренияУслуг").ЭтоИстина());
	Ожидаем.Что(КлючиТаблицДвижений.Свойство("энргСредстваИзмеренияУслуг").ЭтоИстина());
	
	Ожидаем.Что(КлючиТаблицДвижений.Количество()).Равно(15);
	
КонецПроцедуры

Функция ТаблицаПоОписаниюGherkin(Знач GherkinТаблица, Знач ИсходныйОбъект)
	
	СтрокиТаблицы						= СтрРазделить(GherkinТаблица,Символы.ПС);
	КолонкиТаблицы 						= СтрРазделить(СтрокиТаблицы[0],"|");
	ТаблицаЭталон 						= Новый ТаблицаЗначений;
	Для Сч = 0 По КолонкиТаблицы.ВГраница() Цикл
		ТаблицаЭталон.Колонки.Добавить(СокрЛП(КолонкиТаблицы[Сч]));
	КонецЦикла;
	
	Для Сч = 1 По СтрокиТаблицы.ВГраница() Цикл
		
		ДанныеСтроки 									= СтрРазделить(СтрокиТаблицы[Сч],"|",Истина);
		Если ДанныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицыЭталон  							= ТаблицаЭталон.Добавить();		
		Для Колонка = 0 По ДанныеСтроки.ВГраница() Цикл
			СтрокаТаблицыЭталон[СокрЛП(КолонкиТаблицы[Колонка])] = Вычислить(СокрЛП(ДанныеСтроки[Колонка]));  
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаЭталон;
	
КонецФункции

//"(ПроверитьРезультат_)(энрг.{1,})(_ПодключениеУслуги_Базовый\(ОбъектыВПамяти\, ТаблицыДвижений\[КлючиТаблицДвижений\.)(энргАктивностьТочекУчета)(\]\.Выгрузить\(\)\);)";
//"$1$2$3$2$5";